tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1779_tdd.h
#define C3NCH                         522
#define C3NCH0                        523
#define C3NCH1                        524
#define C3NCH2                        525
#define C3NCH3                        526
#define CM3PSEL                       527
#define CM3PSEL_PCH0                  528
#define C3PCH                         529
#define CM3PSEL_PCH                   530
#define C3PCH0                        531
#define CM3PSEL_PCH1                  532
#define C3PCH1                        533
#define CM3PSEL_PCH2                  534
#define C3PCH2                        535
#define CM3PSEL_PCH3                  536
#define C3PCH3                        537
#define ANSELA                        538
#define ANSA0                         539
#define ANSA1                         540
#define ANSA2                         541
#define ANSA3                         542
#define ANSA4                         543
#define ANSA5                         544
#define ANSELB                        545
#define ANSB0                         546
#define ANSB1                         547
#define ANSB2                         548
#define ANSB3                         549
#define ANSB4                         550
#define ANSB5                         551
#define ANSELC                        552
#define ANSC2                         553
#define ANSC3                         554
#define ANSC4                         555
#define ANSC5                         556
#define ANSC6                         557
#define ANSC7                         558
#define ANSELD                        559
#define ANSD0                         560
#define ANSD1                         561
#define ANSD2                         562
#define ANSD3                         563
#define ANSD4                         564
#define ANSD5                         565
#define ANSD6                         566
#define ANSD7                         567
#define ANSELE                        568
#define ANSE0                         569
#define ANSE1                         570
#define ANSE2                         571
#define PMADRL                        572
#define PMADRH                        573
#define PMDATL                        574
#define PMDATH                        575
#define PMCON1                        576
#define RD                            577
#define WR                            578
#define WREN                          579
#define WRERR                         580
#define FREE                          581
#define LWLO                          582
#define CFGS                          583
#define PMCON2                        584
#define RC1REG                        585
#define TX1REG                        586
#define SP1BRGL                       587
#define SP1BRGH                       588
#define RC1STA                        589
#define RX9D                          590
#define OERR                          591
#define FERR                          592
#define ADDEN                         593
#define CREN                          594
#define SREN                          595
#define RX9                           596
#define SPEN                          597
#define TX1STA                        598
#define TX9D                          599
#define TRMT                          600
#define BRGH                          601
#define SENDB                         602
#define TX1STA_SYNC                   603
#define TXEN                          604
#define TX9                           605
#define CSRC                          606
#define BAUD1CON                      607
#define ABDEN                         608
#define WUE                           609
#define BRG16                         610
#define SCKP                          611
#define RCIDL                         612
#define ABDOVF                        613
#define WPUA                          614
#define WPUA0                         615
#define WPUA1                         616
#define WPUA2                         617
#define WPUA3                         618
#define WPUA4                         619
#define WPUA5                         620
#define WPUA6                         621
#define WPUA7                         622
#define WPUB                          623
#define WPUB0                         624
#define WPUB1                         625
#define WPUB2                         626
#define WPUB3                         627
#define WPUB4                         628
#define WPUB5                         629
#define WPUB6                         630
#define WPUB7                         631
#define WPUC                          632
#define WPUC0                         633
#define WPUC1                         634
#define WPUC2                         635
#define WPUC3                         636
#define WPUC4                         637
#define WPUC5                         638
#define WPUC6                         639
#define WPUC7                         640
#define WPUD                          641
#define WPUD0                         642
#define WPUD1                         643
#define WPUD2                         644
#define WPUD3                         645
#define WPUD4                         646
#define WPUD5                         647
#define WPUD6                         648
#define WPUD7                         649
#define WPUE                          650
#define WPUE0                         651
#define WPUE1                         652
#define WPUE2                         653
#define WPUE3                         654
#define SSP1BUF                       655
#define BUF                           656
#define BUF0                          657
#define SSP1BUF0                      658
#define BUF1                          659
#define SSP1BUF1                      660
#define BUF2                          661
#define SSP1BUF2                      662
#define BUF3                          663
#define SSP1BUF3                      664
#define BUF4                          665
#define SSP1BUF4                      666
#define BUF5                          667
#define SSP1BUF5                      668
#define BUF6                          669
#define SSP1BUF6                      670
#define BUF7                          671
#define SSP1BUF7                      672
#define ADD0                          673
#define ADD                           674
#define SSP1ADD0                      675
#define SSP1ADD                       676
#define ADD1                          677
#define SSP1ADD1                      678
#define ADD2                          679
#define SSP1ADD2                      680
#define ADD3                          681
#define SSP1ADD3                      682
#define ADD4                          683
#define SSP1ADD4                      684
#define ADD5                          685
#define SSP1ADD5                      686
#define ADD6                          687
#define SSP1ADD6                      688
#define ADD7                          689
#define SSP1ADD7                      690
#define SSP1MSK0                      691
#define SSP1MSK                       692
#define MSK0                          693
#define MSK                           694
#define SSP1MSK1                      695
#define MSK1                          696
#define SSP1MSK2                      697
#define MSK2                          698
#define SSP1MSK3                      699
#define MSK3                          700
#define SSP1MSK4                      701
#define MSK4                          702
#define SSP1MSK5                      703
#define MSK5                          704
#define SSP1MSK6                      705
#define MSK6                          706
#define SSP1MSK7                      707
#define MSK7                          708
#define SSP1STAT                      709
#define BF                            710
#define UA                            711
#define R_nW                          712
#define S                             713
#define P                             714
#define D_nA                          715
#define CKE                           716
#define SMP                           717
#define SSP1CON1                      718
#define SSPM0                         719
#define SSPM                          720
#define SSPM1                         721
#define SSPM2                         722
#define SSPM3                         723
#define CKP                           724
#define SSPEN                         725
#define SSPOV                         726
#define WCOL                          727
#define SSP1CON2                      728
#define SEN                           729
#define RSEN                          730
#define PEN                           731
#define RCEN                          732
#define ACKEN                         733
#define ACKDT                         734
#define ACKSTAT                       735
#define GCEN                          736
#define SSP1CON3                      737
#define DHEN                          738
#define AHEN                          739
#define SBCDE                         740
#define SDAHT                         741
#define BOEN                          742
#define SCIE                          743
#define PCIE                          744
#define ACKTIM                        745
#define MD3CON0                       746
#define MD3BIT                        747
#define MD3CON0_BIT                   748
#define MD3CON0_OPOL                  749
#define MD3OPOL                       750
#define MD3CON0_OUT                   751
#define MD3OUT                        752
#define MD3EN                         753
#define MD3CON0_EN                    754
#define MD3CON1                       755
#define MD3CLSYNC                     756
#define MD3CON1_CLSYNC                757
#define MD3CLPOL                      758
#define MD3CON1_CLPOL                 759
#define MD3CON1_CHSYNC                760
#define MD3CHSYNC                     761
#define MD3CON1_CHPOL                 762
#define MD3CHPOL                      763
#define MD3SRC                        764
#define MD3SRC_MS                     765
#define MD3MS0                        766
#define MD3SRC_MS0                    767
#define MD3MS                         768
#define MD3SRC_MS1                    769
#define MD3MS1                        770
#define MD3SRC_MS2                    771
#define MD3MS2                        772
#define MD3SRC_MS3                    773
#define MD3MS3                        774
#define MD3SRC_MS4                    775
#define MD3MS4                        776
#define MD3CARL                       777
#define MD3CARL_CL0                   778
#define MD3CL                         779
#define MD3CARL_CL                    780
#define MD3CL0                        781
#define MD3CL1                        782
#define MD3CARL_CL1                   783
#define MD3CARL_CL2                   784
#define MD3CL2                        785
#define MD3CARL_CL3                   786
#define MD3CL3                        787
#define MD3CARL_CL4                   788
#define MD3CARH                       789
#define MD3CARH_CH                    790
#define MD3CARH_CH0                   791
#define MD3CH                         792
#define MD3CH0                        793
#define MD3CARH_CH1                   794
#define MD3CH1                        795
#define MD3CARH_CH2                   796
#define MD3CH2                        797
#define MD3CARH_CH3                   798
#define MD3CH3                        799
#define MD3CARH_CH4                   800
#define ODCONA                        801
#define ODA0                          802
#define ODA1                          803
#define ODA2                          804
#define ODA3                          805
#define ODA4                          806
#define ODA5                          807
#define ODA6                          808
#define ODA7                          809
#define ODCONB                        810
#define ODB0                          811
#define ODB1                          812
#define ODB2                          813
#define ODB3                          814
#define ODB4                          815
#define ODB5                          816
#define ODB6                          817
#define ODB7                          818
#define ODCONC                        819
#define ODC0                          820
#define ODC1                          821
#define ODC2                          822
#define ODC3                          823
#define ODC4                          824
#define ODC5                          825
#define ODC6                          826
#define ODC7                          827
#define ODCOND                        828
#define ODD0                          829
#define ODD1                          830
#define ODD2                          831
#define ODD3                          832
#define ODD4                          833
#define ODD5                          834
#define ODD6                          835
#define ODD7                          836
#define ODCONE                        837
#define ODE0                          838
#define ODE1                          839
#define ODE2                          840
#define CCPR1L                        841
#define CCPR1L_RL                     842
#define CCPR1H                        843
#define CCPR1H_RH                     844
#define CCP1CON                       845
#define CCP1CON_MODE                  846
#define CCP1MODE0                     847
#define CCP1CON_MODE0                 848
#define CCP1MODE                      849
#define CCP1MODE1                     850
#define CCP1CON_MODE1                 851
#define CCP1MODE2                     852
#define CCP1CON_MODE2                 853
#define CCP1MODE3                     854
#define CCP1CON_MODE3                 855
#define CCP1CON_FMT                   856
#define CCP1FMT                       857
#define CCP1CON_OUT                   858
#define CCP1OUT                       859
#define CCP1EN                        860
#define CCP1CON_EN                    861
#define CCP1CAP                       862
#define CCP1CTS0                      863
#define CCP1CAP_CTS                   864
#define CCP1CAP_CTS0                  865
#define CCP1CTS                       866
#define CCP1CTS1                      867
#define CCP1CAP_CTS1                  868
#define CCP1CTS2                      869
#define CCP1CAP_CTS2                  870
#define CCP1CTS3                      871
#define CCP1CAP_CTS3                  872
#define CCPR2L                        873
#define CCPR2L_RL                     874
#define CCPR2H                        875
#define CCPR2H_RH                     876
#define CCP2CON                       877
#define CCP2MODE                      878
#define CCP2MODE0                     879
#define CCP2CON_MODE0                 880
#define CCP2CON_MODE                  881
#define CCP2MODE1                     882
#define CCP2CON_MODE1                 883
#define CCP2MODE2                     884
#define CCP2CON_MODE2                 885
#define CCP2MODE3                     886
#define CCP2CON_MODE3                 887
#define CCP2FMT                       888
#define CCP2CON_FMT                   889
#define CCP2OUT                       890
#define CCP2CON_OUT                   891
#define CCP2EN                        892
#define CCP2CON_EN                    893
#define CCP2CAP                       894
#define CCP2CAP_CTS                   895
#define CCP2CAP_CTS0                  896
#define CCP2CTS                       897
#define CCP2CTS0                      898
#define CCP2CAP_CTS1                  899
#define CCP2CTS1                      900
#define CCP2CAP_CTS2                  901
#define CCP2CTS2                      902
#define CCP2CAP_CTS3                  903
#define CCP2CTS3                      904
#define CCPR7L                        905
#define CCPR7L_RL                     906
#define CCPR7H                        907
#define CCPR7H_RH                     908
#define CCP7CON                       909
#define CCP7CON_MODE0                 910
#define CCP7CON_MODE                  911
#define CCP7MODE0                     912
#define CCP7MODE                      913
#define CCP7CON_MODE1                 914
#define CCP7MODE1                     915
#define CCP7CON_MODE2                 916
#define CCP7MODE2                     917
#define CCP7CON_MODE3                 918
#define CCP7MODE3                     919
#define CCP7CON_FMT                   920
#define CCP7FMT                       921
#define CCP7CON_OUT                   922
#define CCP7OUT                       923
#define CCP7EN                        924
#define CCP7CON_EN                    925
#define CCP7CAP                       926
#define CCP7CTS                       927
#define CCP7CAP_CTS0                  928
#define CCP7CAP_CTS                   929
#define CCP7CTS0                      930
#define CCP7CTS1                      931
#define CCP7CAP_CTS1                  932
#define CCP7CTS2                      933
#define CCP7CAP_CTS2                  934
#define CCP7CAP_CTS3                  935
#define CCP7CTS3                      936
#define CCPTMRS1                      937
#define C1TSEL0                       938
#define C1TSEL                        939
#define C1TSEL1                       940
#define C2TSEL0                       941
#define C2TSEL                        942
#define C2TSEL1                       943
#define C7TSEL                        944
#define C7TSEL0                       945
#define C7TSEL1                       946
#define C8TSEL                        947
#define CCPTMRS2                      948
#define P3TSEL                        949
#define P3TSEL0                       950
#define P3TSEL1                       951
#define P4TSEL0                       952
#define P4TSEL                        953
#define P4TSEL1                       954
#define P9TSEL0                       955
#define P9TSEL                        956
#define P9TSEL1                       957
#define P10TSEL                       958
#define SLRCONA                       959
#define SLRA0                         960
#define SLRA1                         961
#define SLRA2                         962
#define SLRA3                         963
#define SLRA4                         964
#define SLRA5                         965
#define SLRA6                         966
#define SLRA7                         967
#define SLRCONB                       968
#define SLRB0                         969
#define SLRB1                         970
#define SLRB2                         971
#define SLRB3                         972
#define SLRB4                         973
#define SLRB5                         974
#define SLRB6                         975
#define SLRB7                         976
#define SLRCONC                       977
#define SLRC0                         978
#define SLRC1                         979
#define SLRC2                         980
#define SLRC3                         981
#define SLRC4                         982
#define SLRC5                         983
#define SLRC6                         984
#define SLRC7                         985
#define SLRCOND                       986
#define SLRD0                         987
#define SLRD1                         988
#define SLRD2                         989
#define SLRD3                         990
#define SLRD4                         991
#define SLRD5                         992
#define SLRD6                         993
#define SLRD7                         994
#define SLRCONE                       995
#define SLRE0                         996
#define SLRE1                         997
#define SLRE2                         998
#define CCPR8L                        999
#define CCPR8L_RL                     1000
#define CCPR8H                        1001
#define CCPR8H_RH                     1002
#define CCP8CON                       1003
#define CCP8MODE0                     1004
#define CCP8CON_MODE0                 1005
#define CCP8CON_MODE                  1006
#define CCP8MODE                      1007
#define CCP8MODE1                     1008
#define CCP8CON_MODE1                 1009
#define CCP8MODE2                     1010
#define CCP8CON_MODE2                 1011
#define CCP8MODE3                     1012
#define CCP8CON_MODE3                 1013
#define CCP8CON_FMT                   1014
#define CCP8FMT                       1015
#define CCP8CON_OUT                   1016
#define CCP8OUT                       1017
#define CCP8CON_EN                    1018
#define CCP8EN                        1019
#define CCP8CAP                       1020
#define CCP8CAP_CTS                   1021
#define CCP8CTS0                      1022
#define CCP8CAP_CTS0                  1023
#define CCP8CTS                       1024
#define CCP8CTS1                      1025
#define CCP8CAP_CTS1                  1026
#define CCP8CTS2                      1027
#define CCP8CAP_CTS2                  1028
#define CCP8CTS3                      1029
#define CCP8CAP_CTS3                  1030
#define MD1CON0                       1031
#define MD1BIT                        1032
#define MD1CON0_BIT                   1033
#define MD1OPOL                       1034
#define MD1CON0_OPOL                  1035
#define MD1CON0_OUT                   1036
#define MD1OUT                        1037
#define MD1CON0_EN                    1038
#define MD1EN                         1039
#define MD1CON1                       1040
#define MD1CLSYNC                     1041
#define MD1CON1_CLSYNC                1042
#define MD1CON1_CLPOL                 1043
#define MD1CLPOL                      1044
#define MD1CON1_CHSYNC                1045
#define MD1CHSYNC                     1046
#define MD1CHPOL                      1047
#define MD1CON1_CHPOL                 1048
#define MD1SRC                        1049
#define MD1MS0                        1050
#define MD1SRC_MS0                    1051
#define MD1MS                         1052
#define MD1SRC_MS                     1053
#define MD1MS1                        1054
#define MD1SRC_MS1                    1055
#define MD1MS2                        1056
#define MD1SRC_MS2                    1057
#define MD1MS3                        1058
#define MD1SRC_MS3                    1059
#define MD1MS4                        1060
#define MD1SRC_MS4                    1061
#define MD1CARL                       1062
#define MD1CL                         1063
#define MD1CARL_CL0                   1064
#define MD1CL0                        1065
#define MD1CARL_CL                    1066
#define MD1CARL_CL1                   1067
#define MD1CL1                        1068
#define MD1CARL_CL2                   1069
#define MD1CL2                        1070
#define MD1CARL_CL3                   1071
#define MD1CL3                        1072
#define MD1CARL_CL4                   1073
#define MD1CARH                       1074
#define MD1CARH_CH                    1075
#define MD1CH                         1076
#define MD1CH0                        1077
#define MD1CARH_CH0                   1078
#define MD1CH1                        1079
#define MD1CARH_CH1                   1080
#define MD1CH2                        1081
#define MD1CARH_CH2                   1082
#define MD1CH3                        1083
#define MD1CARH_CH3                   1084
#define MD1CARH_CH4                   1085
#define MD2CON0                       1086
#define MD2BIT                        1087
#define MD2CON0_BIT                   1088
#define MD2CON0_OPOL                  1089
#define MD2OPOL                       1090
