tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1779_tdd.h
#define MD2CON0_OUT                   1091
#define MD2OUT                        1092
#define MD2CON0_EN                    1093
#define MD2EN                         1094
#define MD2CON1                       1095
#define MD2CLSYNC                     1096
#define MD2CON1_CLSYNC                1097
#define MD2CON1_CLPOL                 1098
#define MD2CLPOL                      1099
#define MD2CON1_CHSYNC                1100
#define MD2CHSYNC                     1101
#define MD2CHPOL                      1102
#define MD2CON1_CHPOL                 1103
#define MD2SRC                        1104
#define MD2MS                         1105
#define MD2MS0                        1106
#define MD2SRC_MS0                    1107
#define MD2SRC_MS                     1108
#define MD2SRC_MS1                    1109
#define MD2MS1                        1110
#define MD2MS2                        1111
#define MD2SRC_MS2                    1112
#define MD2MS3                        1113
#define MD2SRC_MS3                    1114
#define MD2MS4                        1115
#define MD2SRC_MS4                    1116
#define MD2CARL                       1117
#define MD2CARL_CL                    1118
#define MD2CL0                        1119
#define MD2CARL_CL0                   1120
#define MD2CL                         1121
#define MD2CARL_CL1                   1122
#define MD2CL1                        1123
#define MD2CL2                        1124
#define MD2CARL_CL2                   1125
#define MD2CL3                        1126
#define MD2CARL_CL3                   1127
#define MD2CARL_CL4                   1128
#define MD2CARH                       1129
#define MD2CARH_CH0                   1130
#define MD2CH0                        1131
#define MD2CARH_CH                    1132
#define MD2CH                         1133
#define MD2CARH_CH1                   1134
#define MD2CH1                        1135
#define MD2CARH_CH2                   1136
#define MD2CH2                        1137
#define MD2CARH_CH3                   1138
#define MD2CH3                        1139
#define MD2CARH_CH4                   1140
#define INLVLA                        1141
#define INLVLA0                       1142
#define INLVLA1                       1143
#define INLVLA2                       1144
#define INLVLA3                       1145
#define INLVLA4                       1146
#define INLVLA5                       1147
#define INLVA6                        1148
#define INLVA7                        1149
#define INLVLB                        1150
#define INLVB0                        1151
#define INLVB1                        1152
#define INLVB2                        1153
#define INLVB3                        1154
#define INLVLB4                       1155
#define INLVLB5                       1156
#define INLVLB6                       1157
#define INLVLB7                       1158
#define INLVLC                        1159
#define INLVLC0                       1160
#define INLVLC1                       1161
#define INLVLC2                       1162
#define INLVLC3                       1163
#define INLVLC4                       1164
#define INLVLC5                       1165
#define INLVLC6                       1166
#define INLVLC7                       1167
#define INLVLD                        1168
#define INLVLD0                       1169
#define INLVLD1                       1170
#define INLVLD2                       1171
#define INLVLD3                       1172
#define INLVLD4                       1173
#define INLVLD5                       1174
#define INLVLD6                       1175
#define INLVLD7                       1176
#define INLVE                         1177
#define INLVE0                        1178
#define INLVE1                        1179
#define INLVE2                        1180
#define INLVE3                        1181
#define IOCAP                         1182
#define IOCAP0                        1183
#define IOCAP1                        1184
#define IOCAP2                        1185
#define IOCAP3                        1186
#define IOCAP4                        1187
#define IOCAP5                        1188
#define IOCAP6                        1189
#define IOCAP7                        1190
#define IOCAN                         1191
#define IOCAN0                        1192
#define IOCAN1                        1193
#define IOCAN2                        1194
#define IOCAN3                        1195
#define IOCAN4                        1196
#define IOCAN5                        1197
#define IOCAN6                        1198
#define IOCAN7                        1199
#define IOCAF                         1200
#define IOCAF0                        1201
#define IOCAF1                        1202
#define IOCAF2                        1203
#define IOCAF3                        1204
#define IOCAF4                        1205
#define IOCAF5                        1206
#define IOCAF6                        1207
#define IOCAF7                        1208
#define IOCBP                         1209
#define IOCBP0                        1210
#define IOCBP1                        1211
#define IOCBP2                        1212
#define IOCBP3                        1213
#define IOCBP4                        1214
#define IOCBP5                        1215
#define IOCBP6                        1216
#define IOCBP7                        1217
#define IOCBN                         1218
#define IOCBN0                        1219
#define IOCBN1                        1220
#define IOCBN2                        1221
#define IOCBN3                        1222
#define IOCBN4                        1223
#define IOCBN5                        1224
#define IOCBN6                        1225
#define IOCBN7                        1226
#define IOCBF                         1227
#define IOCBF0                        1228
#define IOCBF1                        1229
#define IOCBF2                        1230
#define IOCBF3                        1231
#define IOCBF4                        1232
#define IOCBF5                        1233
#define IOCBF6                        1234
#define IOCBF7                        1235
#define IOCCP                         1236
#define IOCCP0                        1237
#define IOCCP1                        1238
#define IOCCP2                        1239
#define IOCCP3                        1240
#define IOCCP4                        1241
#define IOCCP5                        1242
#define IOCCP6                        1243
#define IOCCP7                        1244
#define IOCCN                         1245
#define IOCCN0                        1246
#define IOCCN1                        1247
#define IOCCN2                        1248
#define IOCCN3                        1249
#define IOCCN4                        1250
#define IOCCN5                        1251
#define IOCCN6                        1252
#define IOCCN7                        1253
#define IOCCF                         1254
#define IOCCF0                        1255
#define IOCCF1                        1256
#define IOCCF2                        1257
#define IOCCF3                        1258
#define IOCCF4                        1259
#define IOCCF5                        1260
#define IOCCF6                        1261
#define IOCCF7                        1262
#define IOCEP                         1263
#define IOCEP3                        1264
#define IOCEN                         1265
#define IOCEN3                        1266
#define IOCEF                         1267
#define IOCEF3                        1268
#define HIDRVB                        1269
#define HIDB0                         1270
#define HIDB1                         1271
#define TMR5L                         1272
#define TMR5L_TMR                     1273
#define TMR5H                         1274
#define TMR5H_TMR                     1275
#define T5CON                         1276
#define TMR5ON                        1277
#define T5CON_ON                      1278
#define T5ON                          1279
#define T5CON_TMRON                   1280
#define T5CON_SYNC                    1281
#define T5CON_nSYNC                   1282
#define nT5SYNC                       1283
#define T5CON_SOSCEN                  1284
#define T5OSCEN                       1285
#define T5CON_OSCEN                   1286
#define T5CON_CKPS                    1287
#define T5CON_CKPS0                   1288
#define T5CKPS0                       1289
#define T5CON_CKPS1                   1290
#define T5CKPS1                       1291
#define T5CON_CS0                     1292
#define T5CON_CS                      1293
#define T5CS0                         1294
#define TMR5CS0                       1295
#define T5CON_CS1                     1296
#define T5CS1                         1297
#define TMR5CS1                       1298
#define T5GCON                        1299
#define T5GSS0                        1300
#define T5GCON_GSS0                   1301
#define T5GCON_GSS                    1302
#define T5GSS1                        1303
#define T5GCON_GSS1                   1304
#define T5GVAL                        1305
#define T5GCON_GVAL                   1306
#define T5GCON_GGO_nDONE              1307
#define T5GGO_nDONE                   1308
#define T5GSPM                        1309
#define T5GCON_GSPM                   1310
#define T5GTM                         1311
#define T5GCON_GTM                    1312
#define T5GPOL                        1313
#define T5GCON_GPOL                   1314
#define T5GE                          1315
#define TMR5GE                        1316
#define T5GCON_GE                     1317
#define T4TMR                         1318
#define TMR4                          1319
#define T4TMR_TMR                     1320
#define T4PR_PR                       1321
#define T4PR                          1322
#define T4CON                         1323
#define T4CON_OUTPS                   1324
#define T4OUTPS0                      1325
#define T4OUTPS                       1326
#define T4CON_OUTPS0                  1327
#define T4OUTPS1                      1328
#define T4CON_OUTPS1                  1329
#define T4CON_OUTPS2                  1330
#define T4OUTPS2                      1331
#define T4OUTPS3                      1332
#define T4CON_OUTPS3                  1333
#define T4CKPS0                       1334
#define T4CON_CKPS0                   1335
#define T4CKPS                        1336
#define T4CON_CKPS                    1337
#define T4CKPS1                       1338
#define T4CON_CKPS1                   1339
#define T4CKPS2                       1340
#define T4CON_CKPS2                   1341
#define T4CON_ON                      1342
#define T4ON                          1343
#define TMR4ON                        1344
#define T4HLT                         1345
#define T4MODE                        1346
#define T4HLT_MODE                    1347
#define T4HLT_MODE0                   1348
#define T4MODE0                       1349
#define T4HLT_MODE1                   1350
#define T4MODE1                       1351
#define T4HLT_MODE2                   1352
#define T4MODE2                       1353
#define T4HLT_MODE3                   1354
#define T4MODE3                       1355
#define T4HLT_MODE4                   1356
#define T4MODE4                       1357
#define T4HLT_CKSYNC                  1358
#define T4CKSYNC                      1359
#define T4HLT_CKPOL                   1360
#define T4CKPOL                       1361
#define T4HLT_PSYNC                   1362
#define T4PSYNC                       1363
#define T4CLKCON                      1364
#define T4CS                          1365
#define T4CLKCON_CS                   1366
#define T4CS0                         1367
#define T4CLKCON_CS0                  1368
#define T4CS1                         1369
#define T4CLKCON_CS1                  1370
#define T4CS2                         1371
#define T4CLKCON_CS2                  1372
#define T4CS3                         1373
#define T4CLKCON_CS3                  1374
#define T4RST                         1375
#define T4RST_RSEL                    1376
#define T4RSEL0                       1377
#define T4RSEL                        1378
#define T4RST_RSEL0                   1379
#define T4RSEL1                       1380
#define T4RST_RSEL1                   1381
#define T4RSEL2                       1382
#define T4RST_RSEL2                   1383
#define T4RSEL3                       1384
#define T4RST_RSEL3                   1385
#define T4RSEL4                       1386
#define T4RST_RSEL4                   1387
#define T6TMR                         1388
#define TMR6                          1389
#define T6TMR_TMR                     1390
#define T6PR_PR                       1391
#define T6PR                          1392
#define T6CON                         1393
#define T6CON_OUTPS0                  1394
#define T6OUTPS                       1395
#define T6CON_OUTPS                   1396
#define T6OUTPS0                      1397
#define T6CON_OUTPS1                  1398
#define T6OUTPS1                      1399
#define T6CON_OUTPS2                  1400
#define T6OUTPS2                      1401
#define T6CON_OUTPS3                  1402
#define T6OUTPS3                      1403
#define T6CON_CKPS0                   1404
#define T6CKPS                        1405
#define T6CKPS0                       1406
#define T6CON_CKPS                    1407
#define T6CON_CKPS1                   1408
#define T6CKPS1                       1409
#define T6CON_CKPS2                   1410
#define T6CKPS2                       1411
#define TMR6ON                        1412
#define T6ON                          1413
#define T6CON_ON                      1414
#define T6HLT                         1415
#define T6HLT_MODE0                   1416
#define T6HLT_MODE                    1417
#define T6MODE0                       1418
#define T6MODE                        1419
#define T6HLT_MODE1                   1420
#define T6MODE1                       1421
#define T6MODE2                       1422
#define T6HLT_MODE2                   1423
#define T6HLT_MODE3                   1424
#define T6MODE3                       1425
#define T6MODE4                       1426
#define T6HLT_MODE4                   1427
#define T6CKSYNC                      1428
#define T6HLT_CKSYNC                  1429
#define T6CKPOL                       1430
#define T6HLT_CKPOL                   1431
#define T6PSYNC                       1432
#define T6HLT_PSYNC                   1433
#define T6CLKCON                      1434
#define T6CS                          1435
#define T6CLKCON_CS                   1436
#define T6CLKCON_CS0                  1437
#define T6CS0                         1438
#define T6CLKCON_CS1                  1439
#define T6CS1                         1440
#define T6CLKCON_CS2                  1441
#define T6CS2                         1442
#define T6CLKCON_CS3                  1443
#define T6CS3                         1444
#define T6RST                         1445
#define T6RST_RSEL                    1446
#define T6RSEL                        1447
#define T6RSEL0                       1448
#define T6RST_RSEL0                   1449
#define T6RST_RSEL1                   1450
#define T6RSEL1                       1451
#define T6RSEL2                       1452
#define T6RST_RSEL2                   1453
#define T6RST_RSEL3                   1454
#define T6RSEL3                       1455
#define T6RST_RSEL4                   1456
#define T6RSEL4                       1457
#define ADRESL                        1458
#define ADRESL_ADRES                  1459
#define ADRESH                        1460
#define ADRESH_ADRES                  1461
#define ADCON0                        1462
#define ADON                          1463
#define ADCON0_GO                     1464
#define CHS                           1465
#define ADCON1                        1466
#define ADPREF                        1467
#define ADNREF                        1468
#define ADCS                          1469
#define ADFM                          1470
#define ADCON2                        1471
#define TRIGSEL                       1472
#define T2TMR                         1473
#define TMR2                          1474
#define T2TMR_TMR                     1475
#define T2PR                          1476
#define T2PR_PR                       1477
#define T2CON                         1478
#define T2OUTPS0                      1479
#define T2CON_OUTPS0                  1480
#define T2OUTPS                       1481
#define T2CON_OUTPS                   1482
#define T2OUTPS1                      1483
#define T2CON_OUTPS1                  1484
#define T2OUTPS2                      1485
#define T2CON_OUTPS2                  1486
#define T2OUTPS3                      1487
#define T2CON_OUTPS3                  1488
#define T2CKPS0                       1489
#define T2CON_CKPS0                   1490
#define T2CON_CKPS                    1491
#define T2CKPS                        1492
#define T2CKPS1                       1493
#define T2CON_CKPS1                   1494
#define T2CKPS2                       1495
#define T2CON_CKPS2                   1496
#define T2CON_ON                      1497
#define TMR2ON                        1498
#define T2ON                          1499
#define T2HLT                         1500
#define T2HLT_MODE                    1501
#define T2MODE                        1502
#define T2MODE0                       1503
#define T2HLT_MODE0                   1504
#define T2MODE1                       1505
#define T2HLT_MODE1                   1506
#define T2MODE2                       1507
#define T2HLT_MODE2                   1508
#define T2MODE3                       1509
#define T2HLT_MODE3                   1510
#define T2MODE4                       1511
#define T2HLT_MODE4                   1512
#define T2HLT_CKSYNC                  1513
#define T2CKSYNC                      1514
#define T2HLT_CKPOL                   1515
#define T2CKPOL                       1516
#define T2PSYNC                       1517
#define T2HLT_PSYNC                   1518
#define T2CLKCON                      1519
#define T2CS                          1520
#define T2CS0                         1521
#define T2CLKCON_CS                   1522
#define T2CLKCON_CS0                  1523
#define T2CS1                         1524
#define T2CLKCON_CS1                  1525
#define T2CS2                         1526
#define T2CLKCON_CS2                  1527
#define T2CS3                         1528
#define T2CLKCON_CS3                  1529
#define T2RST                         1530
#define T2RSEL                        1531
#define T2RST_RSEL                    1532
#define T2RSEL0                       1533
#define T2RST_RSEL0                   1534
#define T2RSEL1                       1535
#define T2RST_RSEL1                   1536
#define T2RST_RSEL2                   1537
#define T2RSEL2                       1538
#define T2RSEL3                       1539
#define T2RST_RSEL3                   1540
#define T2RSEL4                       1541
#define T2RST_RSEL4                   1542
#define T8TMR                         1543
#define T8TMR_TMR                     1544
#define TMR8                          1545
#define T8PR_PR                       1546
#define T8PR                          1547
#define T8CON                         1548
#define T8OUTPS0                      1549
#define T8OUTPS                       1550
#define T8CON_OUTPS                   1551
#define T8CON_OUTPS0                  1552
#define T8OUTPS1                      1553
#define T8CON_OUTPS1                  1554
#define T8OUTPS2                      1555
#define T8CON_OUTPS2                  1556
#define T8OUTPS3                      1557
#define T8CON_OUTPS3                  1558
#define T8CKPS                        1559
#define T8CON_CKPS0                   1560
#define T8CON_CKPS                    1561
#define T8CKPS0                       1562
#define T8CON_CKPS1                   1563
#define T8CKPS1                       1564
#define T8CON_CKPS2                   1565
#define T8CKPS2                       1566
#define T8ON                          1567
#define T8CON_ON                      1568
#define TMR8ON                        1569
#define T8HLT                         1570
#define T8HLT_MODE                    1571
#define T8MODE0                       1572
#define T8MODE                        1573
#define T8HLT_MODE0                   1574
#define T8MODE1                       1575
#define T8HLT_MODE1                   1576
#define T8MODE2                       1577
#define T8HLT_MODE2                   1578
#define T8MODE3                       1579
#define T8HLT_MODE3                   1580
#define T8MODE4                       1581
#define T8HLT_MODE4                   1582
#define T8CKSYNC                      1583
#define T8HLT_CKSYNC                  1584
#define T8HLT_CKPOL                   1585
#define T8CKPOL                       1586
#define T8HLT_PSYNC                   1587
#define T8PSYNC                       1588
#define T8CLKCON                      1589
#define T8CLKCON_CS0                  1590
#define T8CLKCON_CS                   1591
#define T8CS0                         1592
#define T8CS                          1593
#define T8CS1                         1594
#define T8CLKCON_CS1                  1595
#define T8CS2                         1596
#define T8CLKCON_CS2                  1597
#define T8CS3                         1598
#define T8CLKCON_CS3                  1599
#define T8RST                         1600
#define T8RST_RSEL0                   1601
#define T8RST_RSEL                    1602
#define T8RSEL                        1603
#define T8RSEL0                       1604
#define T8RST_RSEL1                   1605
#define T8RSEL1                       1606
#define T8RSEL2                       1607
#define T8RST_RSEL2                   1608
#define T8RSEL3                       1609
#define T8RST_RSEL3                   1610
#define T8RSEL4                       1611
#define T8RST_RSEL4                   1612
#define OPA1NCHS                      1613
#define OPA1NCH                       1614
#define OPA1NCHS_NCH                  1615
#define OPA1PCHS                      1616
#define OPA1PCHS_PCH                  1617
#define OPA1PCH                       1618
#define OPA1CON                       1619
#define OPA1CON_ORM                   1620
#define OPA1ORM0                      1621
#define OPA1CON_ORM0                  1622
#define OPA1ORM                       1623
#define OPA1ORM1                      1624
#define OPA1CON_ORM1                  1625
#define OPA1CON_ORPOL                 1626
#define OPA1ORPOL                     1627
#define OPA1CON_UG                    1628
#define OPA1UG                        1629
#define OPA1CON_EN                    1630
#define OPA1EN                        1631
#define OPA1ORS                       1632
#define OPA1ORS_ORS                   1633
#define OPA2NCHS                      1634
#define OPA2NCHS_NCH                  1635
#define OPA2NCH                       1636
#define OPA2PCHS                      1637
#define OPA2PCHS_PCH                  1638
#define OPA2PCH                       1639
#define OPA2CON                       1640
#define OPA2CON_ORM0                  1641
#define OPA2ORM                       1642
#define OPA2ORM0                      1643
#define OPA2CON_ORM                   1644
#define OPA2CON_ORM1                  1645
#define OPA2ORM1                      1646
#define OPA2CON_ORPOL                 1647
#define OPA2ORPOL                     1648
