tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1779_tdd.h
#define OPA2CON_UG                    1649
#define OPA2UG                        1650
#define OPA2CON_EN                    1651
#define OPA2EN                        1652
#define OPA2ORS                       1653
#define OPA2ORS_ORS                   1654
#define OPA3NCHS                      1655
#define OPA3NCH                       1656
#define OPA3NCHS_NCH                  1657
#define OPA3PCHS                      1658
#define OPA3PCH                       1659
#define OPA3PCHS_PCH                  1660
#define OPA3CON                       1661
#define OPA3CON_ORM                   1662
#define OPA3ORM0                      1663
#define OPA3ORM                       1664
#define OPA3CON_ORM0                  1665
#define OPA3ORM1                      1666
#define OPA3CON_ORM1                  1667
#define OPA3CON_ORPOL                 1668
#define OPA3ORPOL                     1669
#define OPA3CON_UG                    1670
#define OPA3UG                        1671
#define OPA3CON_SP                    1672
#define OPA3SP                        1673
#define OPA3CON_EN                    1674
#define OPA3EN                        1675
#define OPA3ORS                       1676
#define OPA3ORS_ORS                   1677
#define OPA4NCHS                      1678
#define OPA4NCH                       1679
#define OPA4NCHS_NCH                  1680
#define OPA4PCHS                      1681
#define OPA4PCH                       1682
#define OPA4PCHS_PCH                  1683
#define OPA4CON                       1684
#define OPA4CON_ORM                   1685
#define OPA4CON_ORM0                  1686
#define OPA4ORM0                      1687
#define OPA4ORM                       1688
#define OPA4ORM1                      1689
#define OPA4CON_ORM1                  1690
#define OPA4ORPOL                     1691
#define OPA4CON_ORPOL                 1692
#define OPA4UG                        1693
#define OPA4CON_UG                    1694
#define OPA4CON_SP                    1695
#define OPA4SP                        1696
#define OPA4CON_EN                    1697
#define OPA4EN                        1698
#define OPA4ORS                       1699
#define OPA4ORS_ORS                   1700
#define DACLD                         1701
#define DAC1LD                        1702
#define DAC2LD                        1703
#define DAC5LD                        1704
#define DAC6LD                        1705
#define DAC1CON0                      1706
#define DAC1CON0_DACNSS0              1707
#define DAC1CON0_DACNSS               1708
#define DAC1CON0_NSS0                 1709
#define DAC1NSS                       1710
#define DAC1CON0_NSS                  1711
#define DAC1NSS0                      1712
#define DAC1CON0_NSS1                 1713
#define DAC1NSS1                      1714
#define DAC1CON0_DACNSS1              1715
#define DAC1CON0_DACPSS0              1716
#define DAC1CON0_PSS0                 1717
#define DAC1CON0_PSS                  1718
#define DAC1CON0_DACPSS               1719
#define DAC1PSS                       1720
#define DAC1PSS0                      1721
#define DAC1CON0_DACPSS1              1722
#define DAC1PSS1                      1723
#define DAC1CON0_PSS1                 1724
#define DAC1CON0_OE2                  1725
#define DAC1CON0_DACOE2               1726
#define DAC1OE2                       1727
#define DAC1CON0_OE1                  1728
#define DAC1CON0_DACOE                1729
#define DAC1CON0_OE                   1730
#define DAC1OE1                       1731
#define DAC1CON0_DACOE1               1732
#define DAC1CON0_FM                   1733
#define DAC1FM                        1734
#define DAC1CON0_DACFM                1735
#define DAC1CON0_EN                   1736
#define DAC1CON0_DACEN                1737
#define DAC1EN                        1738
#define DAC1REFL                      1739
#define DAC1REF0                      1740
#define DAC1REFL_R0                   1741
#define DAC1REFL_REF0                 1742
#define DAC1R0                        1743
#define DAC1REF1                      1744
#define DAC1REFL_REF1                 1745
#define DAC1REFL_R1                   1746
#define DAC1R1                        1747
#define DAC1REF2                      1748
#define DAC1REFL_R2                   1749
#define DAC1REFL_REF2                 1750
#define DAC1R2                        1751
#define DAC1REF3                      1752
#define DAC1REFL_R3                   1753
#define DAC1REFL_REF3                 1754
#define DAC1R3                        1755
#define DAC1REF4                      1756
#define DAC1REFL_REF4                 1757
#define DAC1REFL_R4                   1758
#define DAC1R4                        1759
#define DAC1REFL_R5                   1760
#define DAC1REF5                      1761
#define DAC1REFL_REF5                 1762
#define DAC1R5                        1763
#define DAC1REF6                      1764
#define DAC1REFL_REF6                 1765
#define DAC1REFL_R6                   1766
#define DAC1R6                        1767
#define DAC1REF7                      1768
#define DAC1REFL_REF7                 1769
#define DAC1REFL_R7                   1770
#define DAC1R7                        1771
#define DAC1REFH                      1772
#define DAC1REFH_R8                   1773
#define DAC1REF8                      1774
#define DAC1REFH_REF8                 1775
#define DAC1R8                        1776
#define DAC1REF9                      1777
#define DAC1REFH_R9                   1778
#define DAC1REFH_REF9                 1779
#define DAC1R9                        1780
#define DAC1REFH_REF10                1781
#define DAC1R10                       1782
#define DAC1REF10                     1783
#define DAC1REFH_R10                  1784
#define DAC1REFH_REF11                1785
#define DAC1R11                       1786
#define DAC1REF11                     1787
#define DAC1REFH_R11                  1788
#define DAC1REFH_REF12                1789
#define DAC1REF12                     1790
#define DAC1R12                       1791
#define DAC1REFH_R12                  1792
#define DAC1REFH_REF13                1793
#define DAC1R13                       1794
#define DAC1REF13                     1795
#define DAC1REFH_R13                  1796
#define DAC1REFH_REF14                1797
#define DAC1R14                       1798
#define DAC1REF14                     1799
#define DAC1REFH_R14                  1800
#define DAC1REFH_REF15                1801
#define DAC1R15                       1802
#define DAC1REF15                     1803
#define DAC1REFH_R15                  1804
#define DAC2CON0                      1805
#define DAC2CON0_DACNSS               1806
#define DAC2CON0_NSS0                 1807
#define DAC2NSS                       1808
#define DAC2NSS0                      1809
#define DAC2CON0_NSS                  1810
#define DAC2CON0_DACNSS0              1811
#define DAC2CON0_NSS1                 1812
#define DAC2NSS1                      1813
#define DAC2CON0_DACNSS1              1814
#define DAC2CON0_DACPSS0              1815
#define DAC2PSS0                      1816
#define DAC2PSS                       1817
#define DAC2CON0_DACPSS               1818
#define DAC2CON0_PSS0                 1819
#define DAC2CON0_PSS                  1820
#define DAC2CON0_DACPSS1              1821
#define DAC2PSS1                      1822
#define DAC2CON0_PSS1                 1823
#define DAC2CON0_DACOE2               1824
#define DAC2OE2                       1825
#define DAC2CON0_OE2                  1826
#define DAC2CON0_DACOE1               1827
#define DAC2CON0_OE1                  1828
#define DAC2CON0_DACOE                1829
#define DAC2OE1                       1830
#define DAC2CON0_OE                   1831
#define DAC2FM                        1832
#define DAC2CON0_DACFM                1833
#define DAC2CON0_FM                   1834
#define DAC2EN                        1835
#define DAC2CON0_DACEN                1836
#define DAC2CON0_EN                   1837
#define DAC2REFL                      1838
#define DAC2REF0                      1839
#define DAC2REFL_REF0                 1840
#define DAC2REFL_R0                   1841
#define DAC2R0                        1842
#define DAC2REF1                      1843
#define DAC2REFL_REF1                 1844
#define DAC2REFL_R1                   1845
#define DAC2R1                        1846
#define DAC2REF2                      1847
#define DAC2REFL_REF2                 1848
#define DAC2REFL_R2                   1849
#define DAC2R2                        1850
#define DAC2REF3                      1851
#define DAC2REFL_REF3                 1852
#define DAC2REFL_R3                   1853
#define DAC2R3                        1854
#define DAC2REF4                      1855
#define DAC2REFL_REF4                 1856
#define DAC2REFL_R4                   1857
#define DAC2R4                        1858
#define DAC2REF5                      1859
#define DAC2REFL_REF5                 1860
#define DAC2REFL_R5                   1861
#define DAC2R5                        1862
#define DAC2REF6                      1863
#define DAC2REFL_REF6                 1864
#define DAC2REFL_R6                   1865
#define DAC2R6                        1866
#define DAC2REF7                      1867
#define DAC2REFL_REF7                 1868
#define DAC2REFL_R7                   1869
#define DAC2R7                        1870
#define DAC2REFH                      1871
#define DAC2REF8                      1872
#define DAC2REFH_REF8                 1873
#define DAC2R8                        1874
#define DAC2REFH_R8                   1875
#define DAC2REF9                      1876
#define DAC2REFH_REF9                 1877
#define DAC2R9                        1878
#define DAC2REFH_R9                   1879
#define DAC2REFH_REF10                1880
#define DAC2REFH_R10                  1881
#define DAC2REF10                     1882
#define DAC2R10                       1883
#define DAC2REFH_R11                  1884
#define DAC2REFH_REF11                1885
#define DAC2REF11                     1886
#define DAC2R11                       1887
#define DAC2REFH_REF12                1888
#define DAC2REFH_R12                  1889
#define DAC2REF12                     1890
#define DAC2R12                       1891
#define DAC2REFH_R13                  1892
#define DAC2REF13                     1893
#define DAC2REFH_REF13                1894
#define DAC2R13                       1895
#define DAC2REFH_REF14                1896
#define DAC2REFH_R14                  1897
#define DAC2REF14                     1898
#define DAC2R14                       1899
#define DAC2REFH_REF15                1900
#define DAC2REFH_R15                  1901
#define DAC2R15                       1902
#define DAC2REF15                     1903
#define DAC3CON0                      1904
#define DAC3CON0_NSS                  1905
#define DAC3CON0_DACNSS               1906
#define DAC3NSS                       1907
#define DAC3CON0_NSS0                 1908
#define DAC3CON0_DACNSS0              1909
#define DAC3NSS0                      1910
#define DAC3CON0_NSS1                 1911
#define DAC3CON0_DACNSS1              1912
#define DAC3NSS1                      1913
#define DAC3CON0_PSS                  1914
#define DAC3PSS0                      1915
#define DAC3CON0_DACPSS               1916
#define DAC3PSS                       1917
#define DAC3CON0_DACPSS0              1918
#define DAC3CON0_PSS0                 1919
#define DAC3PSS1                      1920
#define DAC3CON0_DACPSS1              1921
#define DAC3CON0_PSS1                 1922
#define DAC3OE2                       1923
#define DAC3CON0_DACOE2               1924
#define DAC3CON0_OE2                  1925
#define DAC3OE1                       1926
#define DAC3CON0_DACOE1               1927
#define DAC3CON0_OE1                  1928
#define DAC3EN                        1929
#define DAC3CON0_EN                   1930
#define DAC3CON0_DACEN                1931
#define DAC3REF                       1932
#define DAC3REF0                      1933
#define DAC3R                         1934
#define DAC3REF_R0                    1935
#define DAC3REF_REF0                  1936
#define DAC3REF_DACR                  1937
#define DAC3R0                        1938
#define DAC3REF_DACR0                 1939
#define DAC3REF1                      1940
#define DAC3REF_R1                    1941
#define DAC3REF_REF1                  1942
#define DAC3R1                        1943
#define DAC3REF_DACR1                 1944
#define DAC3REF2                      1945
#define DAC3REF_R2                    1946
#define DAC3REF_REF2                  1947
#define DAC3R2                        1948
#define DAC3REF_DACR2                 1949
#define DAC3REF3                      1950
#define DAC3REF_REF3                  1951
#define DAC3REF_R3                    1952
#define DAC3R3                        1953
#define DAC3REF_DACR3                 1954
#define DAC3REF4                      1955
#define DAC3REF_REF4                  1956
#define DAC3REF_R4                    1957
#define DAC3R4                        1958
#define DAC3REF_DACR4                 1959
#define DAC4CON0                      1960
#define DAC4CON0_NSS0                 1961
#define DAC4NSS0                      1962
#define DAC4NSS                       1963
#define DAC4CON0_NSS                  1964
#define DAC4CON0_DACNSS0              1965
#define DAC4CON0_DACNSS               1966
#define DAC4CON0_NSS1                 1967
#define DAC4CON0_DACNSS1              1968
#define DAC4NSS1                      1969
#define DAC4PSS                       1970
#define DAC4CON0_DACPSS0              1971
#define DAC4CON0_PSS0                 1972
#define DAC4PSS0                      1973
#define DAC4CON0_DACPSS               1974
#define DAC4CON0_PSS                  1975
#define DAC4CON0_DACPSS1              1976
#define DAC4PSS1                      1977
#define DAC4CON0_PSS1                 1978
#define DAC4OE2                       1979
#define DAC4CON0_OE2                  1980
#define DAC4CON0_DACOE2               1981
#define DAC4CON0_OE1                  1982
#define DAC4CON0_DACOE1               1983
#define DAC4OE1                       1984
#define DAC4CON0_EN                   1985
#define DAC4CON0_DACEN                1986
#define DAC4EN                        1987
#define DAC4REF                       1988
#define DAC4REF_DACR0                 1989
#define DAC4REF_REF0                  1990
#define DAC4REF_DACR                  1991
#define DAC4R0                        1992
#define DAC4REF_R0                    1993
#define DAC4REF0                      1994
#define DAC4R                         1995
#define DAC4REF_DACR1                 1996
#define DAC4REF_REF1                  1997
#define DAC4R1                        1998
#define DAC4REF_R1                    1999
#define DAC4REF1                      2000
#define DAC4REF_DACR2                 2001
#define DAC4REF_REF2                  2002
#define DAC4REF2                      2003
#define DAC4R2                        2004
#define DAC4REF_R2                    2005
#define DAC4REF_DACR3                 2006
#define DAC4REF_REF3                  2007
#define DAC4R3                        2008
#define DAC4REF_R3                    2009
#define DAC4REF3                      2010
#define DAC4REF_DACR4                 2011
#define DAC4REF_R4                    2012
#define DAC4REF_REF4                  2013
#define DAC4R4                        2014
#define DAC4REF4                      2015
#define DAC5CON0                      2016
#define DAC5NSS                       2017
#define DAC5NSS0                      2018
#define DAC5CON0_DACNSS0              2019
#define DAC5CON0_NSS0                 2020
#define DAC5CON0_DACNSS               2021
#define DAC5CON0_NSS                  2022
#define DAC5CON0_DACNSS1              2023
#define DAC5CON0_NSS1                 2024
#define DAC5NSS1                      2025
#define DAC5CON0_DACPSS0              2026
#define DAC5CON0_PSS                  2027
#define DAC5CON0_PSS0                 2028
#define DAC5CON0_DACPSS               2029
#define DAC5PSS0                      2030
#define DAC5PSS                       2031
#define DAC5CON0_DACPSS1              2032
#define DAC5CON0_PSS1                 2033
#define DAC5PSS1                      2034
#define DAC5CON0_DACOE2               2035
#define DAC5OE2                       2036
#define DAC5CON0_OE2                  2037
#define DAC5CON0_DACOE1               2038
#define DAC5OE1                       2039
#define DAC5CON0_OE                   2040
#define DAC5CON0_OE1                  2041
#define DAC5CON0_DACOE                2042
#define DAC5FM                        2043
#define DAC5CON0_FM                   2044
#define DAC5CON0_DACFM                2045
#define DAC5CON0_EN                   2046
#define DAC5CON0_DACEN                2047
#define DAC5EN                        2048
#define DAC5REFL                      2049
#define DAC5REF0                      2050
#define DAC5REFL_REF0                 2051
#define DAC5REFL_R0                   2052
#define DAC5R0                        2053
#define DAC5REFL_R1                   2054
#define DAC5REF1                      2055
#define DAC5REFL_REF1                 2056
#define DAC5R1                        2057
#define DAC5REFL_REF2                 2058
#define DAC5REF2                      2059
#define DAC5REFL_R2                   2060
#define DAC5R2                        2061
#define DAC5REF3                      2062
#define DAC5REFL_REF3                 2063
#define DAC5REFL_R3                   2064
#define DAC5R3                        2065
#define DAC5REF4                      2066
#define DAC5R4                        2067
#define DAC5REFL_REF4                 2068
#define DAC5REFL_R4                   2069
#define DAC5REF5                      2070
#define DAC5R5                        2071
#define DAC5REFL_REF5                 2072
#define DAC5REFL_R5                   2073
#define DAC5REF6                      2074
#define DAC5REFL_REF6                 2075
#define DAC5R6                        2076
#define DAC5REFL_R6                   2077
#define DAC5REF7                      2078
#define DAC5REFL_REF7                 2079
#define DAC5R7                        2080
#define DAC5REFL_R7                   2081
#define DAC5REFH                      2082
#define DAC5REF8                      2083
#define DAC5REFH_REF8                 2084
#define DAC5R8                        2085
#define DAC5REFH_R8                   2086
#define DAC5R9                        2087
#define DAC5REFH_REF9                 2088
#define DAC5REFH_R9                   2089
#define DAC5REF9                      2090
#define DAC5R10                       2091
#define DAC5REFH_REF10                2092
#define DAC5REF10                     2093
#define DAC5REFH_R10                  2094
#define DAC5R11                       2095
#define DAC5REFH_REF11                2096
#define DAC5REF11                     2097
#define DAC5REFH_R11                  2098
#define DAC5R12                       2099
#define DAC5REFH_REF12                2100
#define DAC5REF12                     2101
#define DAC5REFH_R12                  2102
#define DAC5R13                       2103
#define DAC5REFH_REF13                2104
#define DAC5REF13                     2105
#define DAC5REFH_R13                  2106
#define DAC5R14                       2107
#define DAC5REFH_REF14                2108
#define DAC5REF14                     2109
#define DAC5REFH_R14                  2110
#define DAC5R15                       2111
#define DAC5REFH_REF15                2112
#define DAC5REF15                     2113
#define DAC5REFH_R15                  2114
#define DAC6CON0                      2115
#define DAC6CON0_DACNSS               2116
#define DAC6NSS                       2117
#define DAC6NSS0                      2118
#define DAC6CON0_NSS0                 2119
#define DAC6CON0_DACNSS0              2120
#define DAC6CON0_NSS                  2121
#define DAC6NSS1                      2122
#define DAC6CON0_DACNSS1              2123
#define DAC6CON0_NSS1                 2124
#define DAC6CON0_DACPSS0              2125
#define DAC6CON0_PSS0                 2126
#define DAC6PSS                       2127
#define DAC6PSS0                      2128
#define DAC6CON0_PSS                  2129
#define DAC6CON0_DACPSS               2130
#define DAC6CON0_DACPSS1              2131
#define DAC6CON0_PSS1                 2132
#define DAC6PSS1                      2133
#define DAC6CON0_OE2                  2134
#define DAC6CON0_DACOE2               2135
#define DAC6OE2                       2136
#define DAC6CON0_DACOE                2137
#define DAC6CON0_OE1                  2138
#define DAC6CON0_DACOE1               2139
#define DAC6OE1                       2140
#define DAC6CON0_OE                   2141
#define DAC6FM                        2142
#define DAC6CON0_FM                   2143
#define DAC6CON0_DACFM                2144
#define DAC6CON0_DACEN                2145
#define DAC6CON0_EN                   2146
#define DAC6EN                        2147
#define DAC6REFL                      2148
#define DAC6REFL_REF0                 2149
#define DAC6REFL_R0                   2150
#define DAC6REF0                      2151
#define DAC6R0                        2152
#define DAC6REFL_REF1                 2153
#define DAC6REFL_R1                   2154
#define DAC6REF1                      2155
#define DAC6R1                        2156
#define DAC6REFL_REF2                 2157
#define DAC6REFL_R2                   2158
#define DAC6REF2                      2159
#define DAC6R2                        2160
#define DAC6REFL_REF3                 2161
#define DAC6REFL_R3                   2162
#define DAC6REF3                      2163
#define DAC6R3                        2164
#define DAC6REFL_REF4                 2165
#define DAC6REFL_R4                   2166
#define DAC6REF4                      2167
#define DAC6R4                        2168
#define DAC6REFL_REF5                 2169
#define DAC6REFL_R5                   2170
#define DAC6REF5                      2171
#define DAC6R5                        2172
#define DAC6REFL_REF6                 2173
#define DAC6REFL_R6                   2174
#define DAC6REF6                      2175
#define DAC6R6                        2176
#define DAC6REFL_REF7                 2177
#define DAC6REFL_R7                   2178
#define DAC6REF7                      2179
#define DAC6R7                        2180
#define DAC6REFH                      2181
#define DAC6R8                        2182
#define DAC6REF8                      2183
#define DAC6REFH_R8                   2184
#define DAC6REFH_REF8                 2185
#define DAC6R9                        2186
#define DAC6REF9                      2187
#define DAC6REFH_R9                   2188
#define DAC6REFH_REF9                 2189
#define DAC6R10                       2190
#define DAC6REF10                     2191
#define DAC6REFH_R10                  2192
#define DAC6REFH_REF10                2193
#define DAC6R11                       2194
#define DAC6REF11                     2195
#define DAC6REFH_REF11                2196
#define DAC6REFH_R11                  2197
#define DAC6R12                       2198
#define DAC6REF12                     2199
#define DAC6REFH_R12                  2200
#define DAC6REFH_REF12                2201
#define DAC6R13                       2202
#define DAC6REFH_R13                  2203
#define DAC6REFH_REF13                2204
#define DAC6REF13                     2205
#define DAC6R14                       2206
