tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1779_tdd.h
#define G4FSIM2                       3881
#define COG4FSIM0_FSIM3               3882
#define G4FSIM3                       3883
#define COG4FSIM0_FSIM4               3884
#define G4FSIM4                       3885
#define COG4FSIM0_FSIM5               3886
#define G4FSIM5                       3887
#define COG4FSIM0_FSIM6               3888
#define G4FSIM6                       3889
#define COG4FSIM0_FSIM7               3890
#define G4FSIM7                       3891
#define COG4FSIM1                     3892
#define G4FSIM8                       3893
#define COG4FSIM1_FSIM8               3894
#define G4FSIM9                       3895
#define COG4FSIM1_FSIM9               3896
#define COG4FSIM1_FSIM10              3897
#define G4FSIM10                      3898
#define COG4FSIM1_FSIM11              3899
#define G4FSIM11                      3900
#define COG4FSIM1_FSIM12              3901
#define G4FSIM12                      3902
#define COG4FSIM1_FSIM13              3903
#define G4FSIM13                      3904
#define COG4FSIM1_FSIM14              3905
#define G4FSIM14                      3906
#define COG4FSIM1_FSIM15              3907
#define G4FSIM15                      3908
#define COG4ASD0                      3909
#define COG4ASD0_ASDAC                3910
#define G4ASDAC0                      3911
#define COG4ASD0_ASDAC0               3912
#define G4ASDAC                       3913
#define G4ASDAC1                      3914
#define COG4ASD0_ASDAC1               3915
#define COG4ASD0_ASDBD0               3916
#define COG4ASD0_ASDBD                3917
#define G4ASDBD                       3918
#define G4ASDBD0                      3919
#define COG4ASD0_ASDBD1               3920
#define G4ASDBD1                      3921
#define G4ARSEN                       3922
#define COG4ASD0_ARSEN                3923
#define COG4ASD0_ASREN                3924
#define G4ASREN                       3925
#define COG4ASD0_ASE                  3926
#define G4ASE                         3927
#define COG4ASD1                      3928
#define G4AS0E                        3929
#define COG4ASD1_AS0E                 3930
#define COG4ASD1_AS1E                 3931
#define G4AS1E                        3932
#define G4AS2E                        3933
#define COG4ASD1_AS2E                 3934
#define COG4ASD1_AS3E                 3935
#define G4AS3E                        3936
#define G4AS4E                        3937
#define COG4ASD1_AS4E                 3938
#define COG4ASD1_AS5E                 3939
#define G4AS5E                        3940
#define COG4ASD1_AS6E                 3941
#define G4AS6E                        3942
#define COG4ASD1_AS7E                 3943
#define G4AS7E                        3944
#define COG4STR                       3945
#define COG4STR_STRA                  3946
#define G4STRA                        3947
#define COG4STR_STRB                  3948
#define G4STRB                        3949
#define COG4STR_STRC                  3950
#define G4STRC                        3951
#define COG4STR_STRD                  3952
#define G4STRD                        3953
#define G4SDATA                       3954
#define COG4STR_SDATA                 3955
#define G4SDATB                       3956
#define COG4STR_SDATB                 3957
#define G4SDATC                       3958
#define COG4STR_SDATC                 3959
#define G4SDATD                       3960
#define COG4STR_SDATD                 3961
#define CM4CON0                       3962
#define CM4CON0_SYNC                  3963
#define C4SYNC                        3964
#define C4HYS                         3965
#define CM4CON0_HYS                   3966
#define C4SP                          3967
#define C4ZLF                         3968
#define CM4CON0_ZLF                   3969
#define C4POL                         3970
#define CM4CON0_POL                   3971
#define C4OUT                         3972
#define CM4CON0_OUT                   3973
#define C4ON                          3974
#define CM4CON0_ON                    3975
#define CM4CON1                       3976
#define C4INTN                        3977
#define CM4CON1_INTN                  3978
#define CM4CON1_INTP                  3979
#define C4INTP                        3980
#define CM4NSEL                       3981
#define CM4NSEL_NCH                   3982
#define C4NCH0                        3983
#define C4NCH                         3984
#define C4NCH1                        3985
#define C4NCH2                        3986
#define C4NCH3                        3987
#define CM4PSEL                       3988
#define CM4PSEL_PCH0                  3989
#define C4PCH0                        3990
#define C4PCH                         3991
#define CM4PSEL_PCH                   3992
#define CM4PSEL_PCH1                  3993
#define C4PCH1                        3994
#define CM4PSEL_PCH2                  3995
#define C4PCH2                        3996
#define CM4PSEL_PCH3                  3997
#define C4PCH3                        3998
#define CM5CON0                       3999
#define CM5CON0_SYNC                  4000
#define C5SYNC                        4001
#define C5HYS                         4002
#define CM5CON0_HYS                   4003
#define C5SP                          4004
#define CM5CON0_ZLF                   4005
#define C5ZLF                         4006
#define C5POL                         4007
#define CM5CON0_POL                   4008
#define CM5CON0_OUT                   4009
#define C5OUT                         4010
#define CM5CON0_ON                    4011
#define C5ON                          4012
#define CM5CON1                       4013
#define CM5CON1_INTN                  4014
#define C5INTN                        4015
#define CM5CON1_INTP                  4016
#define C5INTP                        4017
#define CM5NSEL                       4018
#define C5NCH                         4019
#define CM5NSEL_NCH                   4020
#define C5NCH0                        4021
#define C5NCH1                        4022
#define C5NCH2                        4023
#define C5NCH3                        4024
#define CM5PSEL                       4025
#define C5PCH                         4026
#define CM5PSEL_PCH                   4027
#define C5PCH0                        4028
#define CM5PSEL_PCH0                  4029
#define C5PCH1                        4030
#define CM5PSEL_PCH1                  4031
#define C5PCH2                        4032
#define CM5PSEL_PCH2                  4033
#define C5PCH3                        4034
#define CM5PSEL_PCH3                  4035
#define CM6CON0                       4036
#define C6SYNC                        4037
#define CM6CON0_SYNC                  4038
#define C6HYS                         4039
#define CM6CON0_HYS                   4040
#define C6SP                          4041
#define CM6CON0_ZLF                   4042
#define C6ZLF                         4043
#define CM6CON0_POL                   4044
#define C6POL                         4045
#define C6OUT                         4046
#define CM6CON0_OUT                   4047
#define CM6CON0_ON                    4048
#define C6ON                          4049
#define CM6CON1                       4050
#define C6INTN                        4051
#define CM6CON1_INTN                  4052
#define CM6CON1_INTP                  4053
#define C6INTP                        4054
#define CM6NSEL                       4055
#define C6NCH                         4056
#define C6NCH0                        4057
#define CM6NSEL_NCH                   4058
#define C6NCH1                        4059
#define C6NCH2                        4060
#define C6NCH3                        4061
#define CM6PSEL                       4062
#define C6PCH                         4063
#define CM6PSEL_PCH0                  4064
#define CM6PSEL_PCH                   4065
#define C6PCH0                        4066
#define CM6PSEL_PCH1                  4067
#define C6PCH1                        4068
#define CM6PSEL_PCH2                  4069
#define C6PCH2                        4070
#define C6PCH3                        4071
#define CM6PSEL_PCH3                  4072
#define CM7CON0                       4073
#define CM7CON0_SYNC                  4074
#define C7SYNC                        4075
#define CM7CON0_HYS                   4076
#define C7HYS                         4077
#define C7SP                          4078
#define CM7CON0_ZLF                   4079
#define C7ZLF                         4080
#define CM7CON0_POL                   4081
#define C7POL                         4082
#define C7OUT                         4083
#define CM7CON0_OUT                   4084
#define CM7CON0_ON                    4085
#define C7ON                          4086
#define CM7CON1                       4087
#define CM7CON1_INTN                  4088
#define C7INTN                        4089
#define C7INTP                        4090
#define CM7CON1_INTP                  4091
#define CM7NSEL                       4092
#define C7NCH                         4093
#define CM7NSEL_NCH                   4094
#define C7NCH0                        4095
#define C7NCH1                        4096
#define C7NCH2                        4097
#define C7NCH3                        4098
#define CM7PSEL                       4099
#define C7PCH0                        4100
#define CM7PSEL_PCH                   4101
#define CM7PSEL_PCH0                  4102
#define C7PCH                         4103
#define C7PCH1                        4104
#define CM7PSEL_PCH1                  4105
#define CM7PSEL_PCH2                  4106
#define C7PCH2                        4107
#define C7PCH3                        4108
#define CM7PSEL_PCH3                  4109
#define CM8CON0                       4110
#define C8SYNC                        4111
#define CM8CON0_SYNC                  4112
#define CM8CON0_HYS                   4113
#define C8HYS                         4114
#define C8SP                          4115
#define C8ZLF                         4116
#define CM8CON0_ZLF                   4117
#define CM8CON0_POL                   4118
#define C8POL                         4119
#define C8OUT                         4120
#define CM8CON0_OUT                   4121
#define CM8CON0_ON                    4122
#define C8ON                          4123
#define CM8CON1                       4124
#define C8INTN                        4125
#define CM8CON1_INTN                  4126
#define CM8CON1_INTP                  4127
#define C8INTP                        4128
#define CM8NSEL                       4129
#define C8NCH0                        4130
#define C8NCH                         4131
#define CM8NSEL_NCH                   4132
#define C8NCH1                        4133
#define C8NCH2                        4134
#define C8NCH3                        4135
#define CM8PSEL                       4136
#define CM8PSEL_PCH                   4137
#define CM8PSEL_PCH0                  4138
#define C8PCH                         4139
#define C8PCH0                        4140
#define CM8PSEL_PCH1                  4141
#define C8PCH1                        4142
#define CM8PSEL_PCH2                  4143
#define C8PCH2                        4144
#define CM8PSEL_PCH3                  4145
#define C8PCH3                        4146
#define MD4CON0                       4147
#define MD4BIT                        4148
#define MD4CON0_BIT                   4149
#define MD4CON0_OPOL                  4150
#define MD4OPOL                       4151
#define MD4OUT                        4152
#define MD4CON0_OUT                   4153
#define MD4CON0_EN                    4154
#define MD4EN                         4155
#define MD4CON1                       4156
#define MD4CLSYNC                     4157
#define MD4CON1_CLSYNC                4158
#define MD4CLPOL                      4159
#define MD4CON1_CLPOL                 4160
#define MD4CHSYNC                     4161
#define MD4CON1_CHSYNC                4162
#define MD4CHPOL                      4163
#define MD4CON1_CHPOL                 4164
#define MD4SRC                        4165
#define MD4MS0                        4166
#define MD4SRC_MS                     4167
#define MD4MS                         4168
#define MD4SRC_MS0                    4169
#define MD4MS1                        4170
#define MD4SRC_MS1                    4171
#define MD4MS2                        4172
#define MD4SRC_MS2                    4173
#define MD4MS3                        4174
#define MD4SRC_MS3                    4175
#define MD4MS4                        4176
#define MD4SRC_MS4                    4177
#define MD4CARL                       4178
#define MD4CL0                        4179
#define MD4CL                         4180
#define MD4CARL_CL0                   4181
#define MD4CARL_CL                    4182
#define MD4CL1                        4183
#define MD4CARL_CL1                   4184
#define MD4CL2                        4185
#define MD4CARL_CL2                   4186
#define MD4CL3                        4187
#define MD4CARL_CL3                   4188
#define MD4CARL_CL4                   4189
#define MD4CARH                       4190
#define MD4CARH_CH0                   4191
#define MD4CH                         4192
#define MD4CH0                        4193
#define MD4CARH_CH                    4194
#define MD4CARH_CH1                   4195
#define MD4CH1                        4196
#define MD4CH2                        4197
#define MD4CARH_CH2                   4198
#define MD4CARH_CH3                   4199
#define MD4CH3                        4200
#define MD4CARH_CH4                   4201
#define PWMEN                         4202
#define MPWM5EN                       4203
#define MPWM6EN                       4204
#define MPWM11EN                      4205
#define MPWM12EN                      4206
#define PWMLD                         4207
#define MPWM5LD                       4208
#define MPWM6LD                       4209
#define MPWM11LD                      4210
#define MPWM12LD                      4211
#define PWMOUT                        4212
#define MPWM5OUT                      4213
#define MPWM6OUT                      4214
#define MPWM11OUT                     4215
#define MPWM12OUT                     4216
#define PWM5PHL0                      4217
#define PWM5PHL_PH                    4218
#define PWM5PHL                       4219
#define PWM5PHL1                      4220
#define PWM5PHL2                      4221
#define PWM5PHL3                      4222
#define PWM5PHL4                      4223
#define PWM5PHL5                      4224
#define PWM5PHL6                      4225
#define PWM5PHL7                      4226
#define PWM5PHH0                      4227
#define PWM5PHH_PH                    4228
#define PWM5PHH                       4229
#define PWM5PHH1                      4230
#define PWM5PHH2                      4231
#define PWM5PHH3                      4232
#define PWM5PHH4                      4233
#define PWM5PHH5                      4234
#define PWM5PHH6                      4235
#define PWM5PHH7                      4236
#define PWM5DCL_DC                    4237
#define PWM5DCL                       4238
#define PWM5DCL0                      4239
#define PWM5DCL1                      4240
#define PWM5DCL2                      4241
#define PWM5DCL3                      4242
#define PWM5DCL4                      4243
#define PWM5DCL5                      4244
#define PWM5DCL6                      4245
#define PWM5DCL7                      4246
#define PWM5DCH_DC                    4247
#define PWM5DCH                       4248
#define PWM5DCH0                      4249
#define PWM5DCH1                      4250
#define PWM5DCH2                      4251
#define PWM5DCH3                      4252
#define PWM5DCH4                      4253
#define PWM5DCH5                      4254
#define PWM5DCH6                      4255
#define PWM5DCH7                      4256
#define PWM5PRL0                      4257
#define PWM5PRL_PR                    4258
#define PWM5PRL                       4259
#define PWM5PRL1                      4260
#define PWM5PRL2                      4261
#define PWM5PRL3                      4262
#define PWM5PRL4                      4263
#define PWM5PRL5                      4264
#define PWM5PRL6                      4265
#define PWM5PRL7                      4266
#define PWM5PRH_PR                    4267
#define PWM5PRH0                      4268
#define PWM5PRH                       4269
#define PWM5PRH1                      4270
#define PWM5PRH2                      4271
#define PWM5PRH3                      4272
#define PWM5PRH4                      4273
#define PWM5PRH5                      4274
#define PWM5PRH6                      4275
#define PWM5PRH7                      4276
#define PWM5OFL                       4277
#define PWM5OFL0                      4278
#define PWM5OFL_OF                    4279
#define PWM5OFL1                      4280
#define PWM5OFL2                      4281
#define PWM5OFL3                      4282
#define PWM5OFL4                      4283
#define PWM5OFL5                      4284
#define PWM5OFL6                      4285
#define PWM5OFL7                      4286
#define PWM5OFH_OF                    4287
#define PWM5OFH                       4288
#define PWM5OFH0                      4289
#define PWM5OFH1                      4290
#define PWM5OFH2                      4291
#define PWM5OFH3                      4292
#define PWM5OFH4                      4293
#define PWM5OFH5                      4294
#define PWM5OFH6                      4295
#define PWM5OFH7                      4296
#define PWM5TMRL_TMR                  4297
#define PWM5TMRL                      4298
#define PWM5TMRL0                     4299
#define PWM5TMRL1                     4300
#define PWM5TMRL2                     4301
#define PWM5TMRL3                     4302
#define PWM5TMRL4                     4303
#define PWM5TMRL5                     4304
#define PWM5TMRL6                     4305
#define PWM5TMRL7                     4306
#define PWM5TMRH0                     4307
#define PWM5TMRH                      4308
#define PWM5TMRH_TMR                  4309
#define PWM5TMRH1                     4310
#define PWM5TMRH2                     4311
#define PWM5TMRH3                     4312
#define PWM5TMRH4                     4313
#define PWM5TMRH5                     4314
#define PWM5TMRH6                     4315
#define PWM5TMRH7                     4316
#define PWM5CON                       4317
#define PWM5MODE0                     4318
#define PWM5CON_MODE                  4319
#define PWM5MODE                      4320
#define PWM5CON_MODE0                 4321
#define PWM5MODE1                     4322
#define PWM5CON_MODE1                 4323
#define PWM5POL                       4324
#define PWM5CON_POL                   4325
#define PWM5OUT                       4326
#define PWM5CON_OUT                   4327
#define PWM5EN                        4328
#define PWM5CON_EN                    4329
#define PWM5INTE                      4330
#define PWM5INTE_PRIE                 4331
#define PWM5PRIE                      4332
#define PWM5INTE_DCIE                 4333
#define PWM5DCIE                      4334
#define PWM5INTE_PHIE                 4335
#define PWM5PHIE                      4336
#define PWM5OFIE                      4337
#define PWM5INTE_OFIE                 4338
#define PWM5INTF                      4339
#define PWM5INTF_PRIF                 4340
#define PWM5PRIF                      4341
#define PWM5INTF_DCIF                 4342
#define PWM5DCIF                      4343
#define PWM5INTF_PHIF                 4344
#define PWM5PHIF                      4345
#define PWM5OFIF                      4346
#define PWM5INTF_OFIF                 4347
#define PWM5CLKCON                    4348
#define PWM5CS0                       4349
#define PWM5CLKCON_CS0                4350
#define PWM5CS                        4351
#define PWM5CLKCON_CS                 4352
#define PWM5CS1                       4353
#define PWM5CLKCON_CS1                4354
#define PWM5CS2                       4355
#define PWM5CLKCON_CS2                4356
#define PWM5PS                        4357
#define PWM5CLKCON_PS0                4358
#define PWM5PS0                       4359
#define PWM5CLKCON_PS                 4360
#define PWM5CLKCON_PS1                4361
#define PWM5PS1                       4362
#define PWM5CLKCON_PS2                4363
#define PWM5PS2                       4364
#define PWM5LDCON                     4365
#define PWM5LDCON_LDS                 4366
#define PWM5LDCON_LDS0                4367
#define PWM5LDS                       4368
#define PWM5LDS0                      4369
#define PWM5LDCON_LDS1                4370
#define PWM5LDS1                      4371
#define PWM5LDCON_LDT                 4372
#define PWM5LDM                       4373
#define PWM5LDCON_LDA                 4374
#define PWM5LD                        4375
#define PWM5OFCON                     4376
#define PWM5OFCON_OFS0                4377
#define PWM5OFCON_OFS                 4378
#define PWM5OFS0                      4379
#define PWM5OFS                       4380
#define PWM5OFCON_OFS1                4381
#define PWM5OFS1                      4382
#define PWM5OFCON_OFO                 4383
#define PWM5OFMC                      4384
#define PWM5OFM                       4385
#define PWM5OFM0                      4386
#define PWM5OFCON_OFM                 4387
#define PWM5OFCON_OFM0                4388
#define PWM5OFM1                      4389
#define PWM5OFCON_OFM1                4390
#define PWM6PHL                       4391
#define PWM6PHL_PH                    4392
#define PWM6PHL0                      4393
#define PWM6PHL1                      4394
#define PWM6PHL2                      4395
#define PWM6PHL3                      4396
#define PWM6PHL4                      4397
#define PWM6PHL5                      4398
#define PWM6PHL6                      4399
#define PWM6PHL7                      4400
#define PWM6PHH0                      4401
#define PWM6PHH                       4402
#define PWM6PHH_PH                    4403
#define PWM6PHH1                      4404
#define PWM6PHH2                      4405
#define PWM6PHH3                      4406
#define PWM6PHH4                      4407
#define PWM6PHH5                      4408
#define PWM6PHH6                      4409
#define PWM6PHH7                      4410
#define PWM6DCL                       4411
#define PWM6DCL_DC                    4412
#define PWM6DCL0                      4413
#define PWM6DCL1                      4414
#define PWM6DCL2                      4415
#define PWM6DCL3                      4416
#define PWM6DCL4                      4417
#define PWM6DCL5                      4418
#define PWM6DCL6                      4419
#define PWM6DCL7                      4420
#define PWM6DCH                       4421
#define PWM6DCH0                      4422
#define PWM6DCH_DC                    4423
#define PWM6DCH1                      4424
#define PWM6DCH2                      4425
#define PWM6DCH3                      4426
#define PWM6DCH4                      4427
#define PWM6DCH5                      4428
#define PWM6DCH6                      4429
#define PWM6DCH7                      4430
#define PWM6PRL0                      4431
#define PWM6PRL                       4432
#define PWM6PRL_PR                    4433
#define PWM6PRL1                      4434
#define PWM6PRL2                      4435
#define PWM6PRL3                      4436
#define PWM6PRL4                      4437
#define PWM6PRL5                      4438
