tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1779_tdd.h
#define PWM6PRL6                      4439
#define PWM6PRL7                      4440
#define PWM6PRH_PR                    4441
#define PWM6PRH                       4442
#define PWM6PRH0                      4443
#define PWM6PRH1                      4444
#define PWM6PRH2                      4445
#define PWM6PRH3                      4446
#define PWM6PRH4                      4447
#define PWM6PRH5                      4448
#define PWM6PRH6                      4449
#define PWM6PRH7                      4450
#define PWM6OFL                       4451
#define PWM6OFL0                      4452
#define PWM6OFL_OF                    4453
#define PWM6OFL1                      4454
#define PWM6OFL2                      4455
#define PWM6OFL3                      4456
#define PWM6OFL4                      4457
#define PWM6OFL5                      4458
#define PWM6OFL6                      4459
#define PWM6OFL7                      4460
#define PWM6OFH                       4461
#define PWM6OFH_OF                    4462
#define PWM6OFH0                      4463
#define PWM6OFH1                      4464
#define PWM6OFH2                      4465
#define PWM6OFH3                      4466
#define PWM6OFH4                      4467
#define PWM6OFH5                      4468
#define PWM6OFH6                      4469
#define PWM6OFH7                      4470
#define PWM6TMRL_TMR                  4471
#define PWM6TMRL                      4472
#define PWM6TMRL0                     4473
#define PWM6TMRL1                     4474
#define PWM6TMRL2                     4475
#define PWM6TMRL3                     4476
#define PWM6TMRL4                     4477
#define PWM6TMRL5                     4478
#define PWM6TMRL6                     4479
#define PWM6TMRL7                     4480
#define PWM6TMRH_TMR                  4481
#define PWM6TMRH0                     4482
#define PWM6TMRH                      4483
#define PWM6TMRH1                     4484
#define PWM6TMRH2                     4485
#define PWM6TMRH3                     4486
#define PWM6TMRH4                     4487
#define PWM6TMRH5                     4488
#define PWM6TMRH6                     4489
#define PWM6TMRH7                     4490
#define PWM6CON                       4491
#define PWM6CON_MODE0                 4492
#define PWM6CON_MODE                  4493
#define PWM6MODE                      4494
#define PWM6MODE0                     4495
#define PWM6CON_MODE1                 4496
#define PWM6MODE1                     4497
#define PWM6POL                       4498
#define PWM6CON_POL                   4499
#define PWM6OUT                       4500
#define PWM6CON_OUT                   4501
#define PWM6EN                        4502
#define PWM6CON_EN                    4503
#define PWM6INTE                      4504
#define PWM6PRIE                      4505
#define PWM6INTE_PRIE                 4506
#define PWM6DCIE                      4507
#define PWM6INTE_DCIE                 4508
#define PWM6PHIE                      4509
#define PWM6INTE_PHIE                 4510
#define PWM6INTE_OFIE                 4511
#define PWM6OFIE                      4512
#define PWM6INTF                      4513
#define PWM6INTF_PRIF                 4514
#define PWM6PRIF                      4515
#define PWM6INTF_DCIF                 4516
#define PWM6DCIF                      4517
#define PWM6PHIF                      4518
#define PWM6INTF_PHIF                 4519
#define PWM6OFIF                      4520
#define PWM6INTF_OFIF                 4521
#define PWM6CLKCON                    4522
#define PWM6CLKCON_CS                 4523
#define PWM6CS                        4524
#define PWM6CLKCON_CS0                4525
#define PWM6CS0                       4526
#define PWM6CLKCON_CS1                4527
#define PWM6CS1                       4528
#define PWM6CLKCON_CS2                4529
#define PWM6CS2                       4530
#define PWM6PS                        4531
#define PWM6CLKCON_PS                 4532
#define PWM6PS0                       4533
#define PWM6CLKCON_PS0                4534
#define PWM6PS1                       4535
#define PWM6CLKCON_PS1                4536
#define PWM6CLKCON_PS2                4537
#define PWM6PS2                       4538
#define PWM6LDCON                     4539
#define PWM6LDS                       4540
#define PWM6LDCON_LDS                 4541
#define PWM6LDCON_LDS0                4542
#define PWM6LDS0                      4543
#define PWM6LDCON_LDS1                4544
#define PWM6LDS1                      4545
#define PWM6LDCON_LDT                 4546
#define PWM6LDM                       4547
#define PWM6LD                        4548
#define PWM6LDCON_LDA                 4549
#define PWM6OFCON                     4550
#define PWM6OFS0                      4551
#define PWM6OFCON_OFS                 4552
#define PWM6OFCON_OFS0                4553
#define PWM6OFS                       4554
#define PWM6OFS1                      4555
#define PWM6OFCON_OFS1                4556
#define PWM6OFCON_OFO                 4557
#define PWM6OFMC                      4558
#define PWM6OFM                       4559
#define PWM6OFCON_OFM                 4560
#define PWM6OFM0                      4561
#define PWM6OFCON_OFM0                4562
#define PWM6OFM1                      4563
#define PWM6OFCON_OFM1                4564
#define PWM11PHL_PH                   4565
#define PWM11PHL                      4566
#define PWM11PHL0                     4567
#define PWM11PHL1                     4568
#define PWM11PHL2                     4569
#define PWM11PHL3                     4570
#define PWM11PHL4                     4571
#define PWM11PHL5                     4572
#define PWM11PHL6                     4573
#define PWM11PHL7                     4574
#define PWM11PHH0                     4575
#define PWM11PHH                      4576
#define PWM11PHH_PH                   4577
#define PWM11PHH1                     4578
#define PWM11PHH2                     4579
#define PWM11PHH3                     4580
#define PWM11PHH4                     4581
#define PWM11PHH5                     4582
#define PWM11PHH6                     4583
#define PWM11PHH7                     4584
#define PWM11DCL_DC                   4585
#define PWM11DCL0                     4586
#define PWM11DCL                      4587
#define PWM11DCL1                     4588
#define PWM11DCL2                     4589
#define PWM11DCL3                     4590
#define PWM11DCL4                     4591
#define PWM11DCL5                     4592
#define PWM11DCL6                     4593
#define PWM11DCL7                     4594
#define PWM11DCH0                     4595
#define PWM11DCH_DC                   4596
#define PWM11DCH                      4597
#define PWM11DCH1                     4598
#define PWM11DCH2                     4599
#define PWM11DCH3                     4600
#define PWM11DCH4                     4601
#define PWM11DCH5                     4602
#define PWM11DCH6                     4603
#define PWM11DCH7                     4604
#define PWM11PRL0                     4605
#define PWM11PRL_PR                   4606
#define PWM11PRL                      4607
#define PWM11PRL1                     4608
#define PWM11PRL2                     4609
#define PWM11PRL3                     4610
#define PWM11PRL4                     4611
#define PWM11PRL5                     4612
#define PWM11PRL6                     4613
#define PWM11PRL7                     4614
#define PWM11PRH0                     4615
#define PWM11PRH_PR                   4616
#define PWM11PRH                      4617
#define PWM11PRH1                     4618
#define PWM11PRH2                     4619
#define PWM11PRH3                     4620
#define PWM11PRH4                     4621
#define PWM11PRH5                     4622
#define PWM11PRH6                     4623
#define PWM11PRH7                     4624
#define PWM11OFL_OF                   4625
#define PWM11OFL                      4626
#define PWM11OFL0                     4627
#define PWM11OFL1                     4628
#define PWM11OFL2                     4629
#define PWM11OFL3                     4630
#define PWM11OFL4                     4631
#define PWM11OFL5                     4632
#define PWM11OFL6                     4633
#define PWM11OFL7                     4634
#define PWM11OFH0                     4635
#define PWM11OFH                      4636
#define PWM11OFH_OF                   4637
#define PWM11OFH1                     4638
#define PWM11OFH2                     4639
#define PWM11OFH3                     4640
#define PWM11OFH4                     4641
#define PWM11OFH5                     4642
#define PWM11OFH6                     4643
#define PWM11OFH7                     4644
#define PWM11TMRL_TMR                 4645
#define PWM11TMRL0                    4646
#define PWM11TMRL                     4647
#define PWM11TMRL1                    4648
#define PWM11TMRL2                    4649
#define PWM11TMRL3                    4650
#define PWM11TMRL4                    4651
#define PWM11TMRL5                    4652
#define PWM11TMRL6                    4653
#define PWM11TMRL7                    4654
#define PWM11TMRH_TMR                 4655
#define PWM11TMRH                     4656
#define PWM11TMRH0                    4657
#define PWM11TMRH1                    4658
#define PWM11TMRH2                    4659
#define PWM11TMRH3                    4660
#define PWM11TMRH4                    4661
#define PWM11TMRH5                    4662
#define PWM11TMRH6                    4663
#define PWM11TMRH7                    4664
#define PWM11CON                      4665
#define PWM11MODE0                    4666
#define PWM11MODE                     4667
#define PWM11CON_MODE0                4668
#define PWM11CON_MODE                 4669
#define PWM11MODE1                    4670
#define PWM11CON_MODE1                4671
#define PWM11CON_POL                  4672
#define PWM11POL                      4673
#define PWM11CON_OUT                  4674
#define PWM11OUT                      4675
#define PWM11EN                       4676
#define PWM11CON_EN                   4677
#define PWM11INTE                     4678
#define PWM11INTE_PRIE                4679
#define PWM11PRIE                     4680
#define PWM11INTE_DCIE                4681
#define PWM11DCIE                     4682
#define PWM11INTE_PHIE                4683
#define PWM11PHIE                     4684
#define PWM11INTE_OFIE                4685
#define PWM11OFIE                     4686
#define PWM11INTF                     4687
#define PWM11INTF_PRIF                4688
#define PWM11PRIF                     4689
#define PWM11INTF_DCIF                4690
#define PWM11DCIF                     4691
#define PWM11PHIF                     4692
#define PWM11INTF_PHIF                4693
#define PWM11INTF_OFIF                4694
#define PWM11OFIF                     4695
#define PWM11CLKCON                   4696
#define PWM11CS0                      4697
#define PWM11CLKCON_CS0               4698
#define PWM11CS                       4699
#define PWM11CLKCON_CS                4700
#define PWM11CS1                      4701
#define PWM11CLKCON_CS1               4702
#define PWM11CLKCON_CS2               4703
#define PWM11CS2                      4704
#define PWM11PS0                      4705
#define PWM11PS                       4706
#define PWM11CLKCON_PS                4707
#define PWM11CLKCON_PS0               4708
#define PWM11PS1                      4709
#define PWM11CLKCON_PS1               4710
#define PWM11PS2                      4711
#define PWM11CLKCON_PS2               4712
#define PWM11LDCON                    4713
#define PWM11LDS0                     4714
#define PWM11LDCON_LDS                4715
#define PWM11LDCON_LDS0               4716
#define PWM11LDS                      4717
#define PWM11LDS1                     4718
#define PWM11LDCON_LDS1               4719
#define PWM11LDM                      4720
#define PWM11LDCON_LDT                4721
#define PWM11LD                       4722
#define PWM11LDCON_LDA                4723
#define PWM11OFCON                    4724
#define PWM11OFS0                     4725
#define PWM11OFCON_OFS0               4726
#define PWM11OFS                      4727
#define PWM11OFCON_OFS                4728
#define PWM11OFCON_OFS1               4729
#define PWM11OFS1                     4730
#define PWM11OFCON_OFO                4731
#define PWM11OFMC                     4732
#define PWM11OFCON_OFM0               4733
#define PWM11OFCON_OFM                4734
#define PWM11OFM                      4735
#define PWM11OFM0                     4736
#define PWM11OFCON_OFM1               4737
#define PWM11OFM1                     4738
#define PWM12PHL0                     4739
#define PWM12PHL_PH                   4740
#define PWM12PHL                      4741
#define PWM12PHL1                     4742
#define PWM12PHL2                     4743
#define PWM12PHL3                     4744
#define PWM12PHL4                     4745
#define PWM12PHL5                     4746
#define PWM12PHL6                     4747
#define PWM12PHL7                     4748
#define PWM12PHH                      4749
#define PWM12PHH0                     4750
#define PWM12PHH_PH                   4751
#define PWM12PHH1                     4752
#define PWM12PHH2                     4753
#define PWM12PHH3                     4754
#define PWM12PHH4                     4755
#define PWM12PHH5                     4756
#define PWM12PHH6                     4757
#define PWM12PHH7                     4758
#define PWM12DCL_DC                   4759
#define PWM12DCL0                     4760
#define PWM12DCL                      4761
#define PWM12DCL1                     4762
#define PWM12DCL2                     4763
#define PWM12DCL3                     4764
#define PWM12DCL4                     4765
#define PWM12DCL5                     4766
#define PWM12DCL6                     4767
#define PWM12DCL7                     4768
#define PWM12DCH_DC                   4769
#define PWM12DCH                      4770
#define PWM12DCH0                     4771
#define PWM12DCH1                     4772
#define PWM12DCH2                     4773
#define PWM12DCH3                     4774
#define PWM12DCH4                     4775
#define PWM12DCH5                     4776
#define PWM12DCH6                     4777
#define PWM12DCH7                     4778
#define PWM12PRL                      4779
#define PWM12PRL0                     4780
#define PWM12PRL_PR                   4781
#define PWM12PRL1                     4782
#define PWM12PRL2                     4783
#define PWM12PRL3                     4784
#define PWM12PRL4                     4785
#define PWM12PRL5                     4786
#define PWM12PRL6                     4787
#define PWM12PRL7                     4788
#define PWM12PRH                      4789
#define PWM12PRH_PR                   4790
#define PWM12PRH0                     4791
#define PWM12PRH1                     4792
#define PWM12PRH2                     4793
#define PWM12PRH3                     4794
#define PWM12PRH4                     4795
#define PWM12PRH5                     4796
#define PWM12PRH6                     4797
#define PWM12PRH7                     4798
#define PWM12OFL0                     4799
#define PWM12OFL_OF                   4800
#define PWM12OFL                      4801
#define PWM12OFL1                     4802
#define PWM12OFL2                     4803
#define PWM12OFL3                     4804
#define PWM12OFL4                     4805
#define PWM12OFL5                     4806
#define PWM12OFL6                     4807
#define PWM12OFL7                     4808
#define PWM12OFH_OF                   4809
#define PWM12OFH                      4810
#define PWM12OFH0                     4811
#define PWM12OFH1                     4812
#define PWM12OFH2                     4813
#define PWM12OFH3                     4814
#define PWM12OFH4                     4815
#define PWM12OFH5                     4816
#define PWM12OFH6                     4817
#define PWM12OFH7                     4818
#define PWM12TMRL0                    4819
#define PWM12TMRL_TMR                 4820
#define PWM12TMRL                     4821
#define PWM12TMRL1                    4822
#define PWM12TMRL2                    4823
#define PWM12TMRL3                    4824
#define PWM12TMRL4                    4825
#define PWM12TMRL5                    4826
#define PWM12TMRL6                    4827
#define PWM12TMRL7                    4828
#define PWM12TMRH                     4829
#define PWM12TMRH0                    4830
#define PWM12TMRH_TMR                 4831
#define PWM12TMRH1                    4832
#define PWM12TMRH2                    4833
#define PWM12TMRH3                    4834
#define PWM12TMRH4                    4835
#define PWM12TMRH5                    4836
#define PWM12TMRH6                    4837
#define PWM12TMRH7                    4838
#define PWM12CON                      4839
#define PWM12CON_MODE                 4840
#define PWM12MODE                     4841
#define PWM12MODE0                    4842
#define PWM12CON_MODE0                4843
#define PWM12CON_MODE1                4844
#define PWM12MODE1                    4845
#define PWM12CON_POL                  4846
#define PWM12POL                      4847
#define PWM12CON_OUT                  4848
#define PWM12OUT                      4849
#define PWM12EN                       4850
#define PWM12CON_EN                   4851
#define PWM12INTE                     4852
#define PWM12PRIE                     4853
#define PWM12INTE_PRIE                4854
#define PWM12DCIE                     4855
#define PWM12INTE_DCIE                4856
#define PWM12INTE_PHIE                4857
#define PWM12PHIE                     4858
#define PWM12INTE_OFIE                4859
#define PWM12OFIE                     4860
#define PWM12INTF                     4861
#define PWM12INTF_PRIF                4862
#define PWM12PRIF                     4863
#define PWM12INTF_DCIF                4864
#define PWM12DCIF                     4865
#define PWM12PHIF                     4866
#define PWM12INTF_PHIF                4867
#define PWM12OFIF                     4868
#define PWM12INTF_OFIF                4869
#define PWM12CLKCON                   4870
#define PWM12CS0                      4871
#define PWM12CLKCON_CS                4872
#define PWM12CS                       4873
#define PWM12CLKCON_CS0               4874
#define PWM12CS1                      4875
#define PWM12CLKCON_CS1               4876
#define PWM12CS2                      4877
#define PWM12CLKCON_CS2               4878
#define PWM12CLKCON_PS                4879
#define PWM12PS0                      4880
#define PWM12CLKCON_PS0               4881
#define PWM12PS                       4882
#define PWM12PS1                      4883
#define PWM12CLKCON_PS1               4884
#define PWM12PS2                      4885
#define PWM12CLKCON_PS2               4886
#define PWM12LDCON                    4887
#define PWM12LDCON_LDS0               4888
#define PWM12LDCON_LDS                4889
#define PWM12LDS                      4890
#define PWM12LDS0                     4891
#define PWM12LDS1                     4892
#define PWM12LDCON_LDS1               4893
#define PWM12LDCON_LDT                4894
#define PWM12LDM                      4895
#define PWM12LD                       4896
#define PWM12LDCON_LDA                4897
#define PWM12OFCON                    4898
#define PWM12OFCON_OFS0               4899
#define PWM12OFS                      4900
#define PWM12OFCON_OFS                4901
#define PWM12OFS0                     4902
#define PWM12OFCON_OFS1               4903
#define PWM12OFS1                     4904
#define PWM12OFMC                     4905
#define PWM12OFCON_OFO                4906
#define PWM12OFM0                     4907
#define PWM12OFCON_OFM                4908
#define PWM12OFCON_OFM0               4909
#define PWM12OFM                      4910
#define PWM12OFM1                     4911
#define PWM12OFCON_OFM1               4912
#define PPSLOCK                       4913
#define PPSLOCKED                     4914
#define INTPPS                        4915
#define T0CKIPPS                      4916
#define T1CKIPPS                      4917
#define T1GPPS                        4918
#define T3CKIPPS                      4919
#define T3GPPS                        4920
#define T5CKIPPS                      4921
#define T5GPPS                        4922
#define T2INPPS                       4923
#define T4INPPS                       4924
#define T6INPPS                       4925
#define T8INPPS                       4926
#define CCP1PPS                       4927
#define CCP2PPS                       4928
#define CCP7PPS                       4929
#define CCP8PPS                       4930
#define COG1INPPS                     4931
#define COG2INPPS                     4932
#define COG3INPPS                     4933
#define COG4INPPS                     4934
#define MD1CLPPS                      4935
#define MD1CHPPS                      4936
#define MD1MODPPS                     4937
#define MD2CLPPS                      4938
#define MD2CHPPS                      4939
#define MD2MODPPS                     4940
#define MD3CLPPS                      4941
#define MD3CHPPS                      4942
#define MD3MODPPS                     4943
#define MD4CLPPS                      4944
#define MD4CHPPS                      4945
#define MD4MODPPS                     4946
#define PRG1RPPS                      4947
#define PRG1FPPS                      4948
#define PRG2RPPS                      4949
#define PRG2FPPS                      4950
#define PRG3RPPS                      4951
#define PRG3FPPS                      4952
#define PRG4RPPS                      4953
#define PRG4FPPS                      4954
#define CLCIN0PPS                     4955
#define CLCIN1PPS                     4956
#define CLCIN2PPS                     4957
#define CLCIN3PPS                     4958
#define ADCACTPPS                     4959
#define SSPCLKPPS                     4960
#define SSPDATPPS                     4961
#define SSPSSPPS                      4962
#define RXPPS                         4963
#define CKPPS                         4964
#define RA0PPS                        4965
#define RA1PPS                        4966
#define RA2PPS                        4967
#define RA3PPS                        4968
#define RA4PPS                        4969
#define RA5PPS                        4970
#define RA6PPS                        4971
#define RA7PPS                        4972
#define RB0PPS                        4973
#define RB1PPS                        4974
#define RB2PPS                        4975
#define RB3PPS                        4976
#define RB4PPS                        4977
#define RB5PPS                        4978
#define RB6PPS                        4979
#define RB7PPS                        4980
#define RC0PPS                        4981
#define RC1PPS                        4982
#define RC2PPS                        4983
#define RC3PPS                        4984
#define RC4PPS                        4985
#define RC5PPS                        4986
#define RC6PPS                        4987
#define RC7PPS                        4988
#define RD0PPS                        4989
#define RD1PPS                        4990
#define RD2PPS                        4991
#define RD3PPS                        4992
#define RD4PPS                        4993
#define RD5PPS                        4994
#define RD6PPS                        4995
#define RD7PPS                        4996
