tiborsimon/embedded-tdd-headers/pic/pic16/pic16lf1779_tdd.h
#define RE0PPS                        4997
#define RE1PPS                        4998
#define RE2PPS                        4999
#define CLCDATA                       5000
#define MCLC1OUT                      5001
#define MCLC2OUT                      5002
#define MCLC3OUT                      5003
#define MLC4OUT                       5004
#define CLC1CON                       5005
#define CLC1CON_MODE                  5006
#define LC1MODE0                      5007
#define LC1MODE                       5008
#define CLC1CON_MODE0                 5009
#define LC1MODE1                      5010
#define CLC1CON_MODE1                 5011
#define CLC1CON_MODE2                 5012
#define LC1MODE2                      5013
#define LC1INTN                       5014
#define CLC1CON_INTN                  5015
#define LC1INTP                       5016
#define CLC1CON_INTP                  5017
#define CLC1CON_OUT                   5018
#define LC1OUT                        5019
#define LC1EN                         5020
#define CLC1CON_EN                    5021
#define CLC1POL                       5022
#define LC1G1POL                      5023
#define CLC1POL_G1POL                 5024
#define CLC1POL_G2POL                 5025
#define LC1G2POL                      5026
#define LC1G3POL                      5027
#define CLC1POL_G3POL                 5028
#define LC1G4POL                      5029
#define CLC1POL_G4POL                 5030
#define CLC1POL_POL                   5031
#define LC1POL                        5032
#define CLC1SEL0                      5033
#define CLC1SEL0_D1S0                 5034
#define LC1D1S0                       5035
#define CLC1SEL0_D1S                  5036
#define LC1D1S                        5037
#define CLC1SEL0_D1S1                 5038
#define LC1D1S1                       5039
#define CLC1SEL0_D1S2                 5040
#define LC1D1S2                       5041
#define LC1D1S3                       5042
#define CLC1SEL0_D1S3                 5043
#define CLC1SEL0_D1S4                 5044
#define LC1D1S4                       5045
#define CLC1SEL0_D1S5                 5046
#define LC1D1S5                       5047
#define CLC1SEL1                      5048
#define CLC1SEL1_D2S0                 5049
#define CLC1SEL1_D2S                  5050
#define LC1D2S                        5051
#define LC1D2S0                       5052
#define CLC1SEL1_D2S1                 5053
#define LC1D2S1                       5054
#define CLC1SEL1_D2S2                 5055
#define LC1D2S2                       5056
#define LC1D2S3                       5057
#define CLC1SEL1_D2S3                 5058
#define LC1D2S4                       5059
#define CLC1SEL1_D2S4                 5060
#define LC1D2S5                       5061
#define CLC1SEL1_D2S5                 5062
#define CLC1SEL2                      5063
#define LC1D3S0                       5064
#define CLC1SEL2_D3S                  5065
#define LC1D3S                        5066
#define CLC1SEL2_D3S0                 5067
#define LC1D3S1                       5068
#define CLC1SEL2_D3S1                 5069
#define LC1D3S2                       5070
#define CLC1SEL2_D3S2                 5071
#define LC1D3S3                       5072
#define CLC1SEL2_D3S3                 5073
#define LC1D3S4                       5074
#define CLC1SEL2_D3S4                 5075
#define LC1D3S5                       5076
#define CLC1SEL2_D3S5                 5077
#define CLC1SEL3                      5078
#define CLC1SEL3_D4S                  5079
#define LC1D4S                        5080
#define LC1D4S0                       5081
#define CLC1SEL3_D4S0                 5082
#define CLC1SEL3_D4S1                 5083
#define LC1D4S1                       5084
#define LC1D4S2                       5085
#define CLC1SEL3_D4S2                 5086
#define LC1D4S3                       5087
#define CLC1SEL3_D4S3                 5088
#define LC1D4S4                       5089
#define CLC1SEL3_D4S4                 5090
#define LC1D4S5                       5091
#define CLC1SEL3_D4S5                 5092
#define CLC1GLS0                      5093
#define CLC1GLS0_D1N                  5094
#define LC1G1D1N                      5095
#define CLC1GLS0_D1T                  5096
#define LC1G1D1T                      5097
#define LC1G1D2N                      5098
#define CLC1GLS0_D2N                  5099
#define LC1G1D2T                      5100
#define CLC1GLS0_D2T                  5101
#define CLC1GLS0_D3N                  5102
#define LC1G1D3N                      5103
#define CLC1GLS0_D3T                  5104
#define LC1G1D3T                      5105
#define CLC1GLS0_D4N                  5106
#define LC1G1D4N                      5107
#define CLC1GLS0_D4T                  5108
#define LC1G1D4T                      5109
#define CLC1GLS1                      5110
#define CLC1GLS1_D1N                  5111
#define LC1G2D1N                      5112
#define LC1G2D1T                      5113
#define CLC1GLS1_D1T                  5114
#define CLC1GLS1_D2N                  5115
#define LC1G2D2N                      5116
#define LC1G2D2T                      5117
#define CLC1GLS1_D2T                  5118
#define CLC1GLS1_D3N                  5119
#define LC1G2D3N                      5120
#define LC1G2D3T                      5121
#define CLC1GLS1_D3T                  5122
#define CLC1GLS1_D4N                  5123
#define LC1G2D4N                      5124
#define LC1G2D4T                      5125
#define CLC1GLS1_D4T                  5126
#define CLC1GLS2                      5127
#define CLC1GLS2_D1N                  5128
#define LC1G3D1N                      5129
#define LC1G3D1T                      5130
#define CLC1GLS2_D1T                  5131
#define LC1G3D2N                      5132
#define CLC1GLS2_D2N                  5133
#define LC1G3D2T                      5134
#define CLC1GLS2_D2T                  5135
#define CLC1GLS2_D3N                  5136
#define LC1G3D3N                      5137
#define LC1G3D3T                      5138
#define CLC1GLS2_D3T                  5139
#define LC1G3D4N                      5140
#define CLC1GLS2_D4N                  5141
#define LC1G3D4T                      5142
#define CLC1GLS2_D4T                  5143
#define CLC1GLS3                      5144
#define LC1G4D1N                      5145
#define CLC1GLS3_G4D1N                5146
#define LC1G4D1T                      5147
#define CLC1GLS3_G4D1T                5148
#define CLC1GLS3_G4D2N                5149
#define LC1G4D2N                      5150
#define CLC1GLS3_G4D2T                5151
#define LC1G4D2T                      5152
#define LC1G4D3N                      5153
#define CLC1GLS3_G4D3N                5154
#define LC1G4D3T                      5155
#define CLC1GLS3_G4D3T                5156
#define CLC1GLS3_G4D4N                5157
#define LC1G4D4N                      5158
#define CLC1GLS3_G4D4T                5159
#define LC1G4D4T                      5160
#define CLC2CON                       5161
#define LC2MODE0                      5162
#define CLC2CON_MODE                  5163
#define LC2MODE                       5164
#define CLC2CON_MODE0                 5165
#define LC2MODE1                      5166
#define CLC2CON_MODE1                 5167
#define LC2MODE2                      5168
#define CLC2CON_MODE2                 5169
#define LC2INTN                       5170
#define CLC2CON_INTN                  5171
#define LC2INTP                       5172
#define CLC2CON_INTP                  5173
#define CLC2CON_OUT                   5174
#define LC2OUT                        5175
#define CLC2CON_EN                    5176
#define LC2EN                         5177
#define CLC2POL                       5178
#define LC2G1POL                      5179
#define CLC2POL_G1POL                 5180
#define LC2G2POL                      5181
#define CLC2POL_G2POL                 5182
#define LC2G3POL                      5183
#define CLC2POL_G3POL                 5184
#define LC2G4POL                      5185
#define CLC2POL_G4POL                 5186
#define CLC2POL_POL                   5187
#define LC2POL                        5188
#define CLC2SEL0                      5189
#define CLC2SEL0_D1S                  5190
#define LC2D1S0                       5191
#define CLC2SEL0_D1S0                 5192
#define LC2D1S                        5193
#define LC2D1S1                       5194
#define CLC2SEL0_D1S1                 5195
#define LC2D1S2                       5196
#define CLC2SEL0_D1S2                 5197
#define CLC2SEL0_D1S3                 5198
#define LC2D1S3                       5199
#define LC2D1S4                       5200
#define CLC2SEL0_D1S4                 5201
#define LC2D1S5                       5202
#define CLC2SEL0_D1S5                 5203
#define CLC2SEL1                      5204
#define LC2D2S0                       5205
#define CLC2SEL1_D2S0                 5206
#define LC2D2S                        5207
#define CLC2SEL1_D2S                  5208
#define LC2D2S1                       5209
#define CLC2SEL1_D2S1                 5210
#define LC2D2S2                       5211
#define CLC2SEL1_D2S2                 5212
#define LC2D2S3                       5213
#define CLC2SEL1_D2S3                 5214
#define LC2D2S4                       5215
#define CLC2SEL1_D2S4                 5216
#define LC2D2S5                       5217
#define CLC2SEL1_D2S5                 5218
#define CLC2SEL2                      5219
#define CLC2SEL2_D3S                  5220
#define LC2D3S0                       5221
#define CLC2SEL2_D3S0                 5222
#define LC2D3S                        5223
#define CLC2SEL2_D3S1                 5224
#define LC2D3S1                       5225
#define LC2D3S2                       5226
#define CLC2SEL2_D3S2                 5227
#define LC2D3S3                       5228
#define CLC2SEL2_D3S3                 5229
#define LC2D3S4                       5230
#define CLC2SEL2_D3S4                 5231
#define LC2D3S5                       5232
#define CLC2SEL2_D3S5                 5233
#define CLC2SEL3                      5234
#define LC2D4S0                       5235
#define CLC2SEL3_D4S                  5236
#define CLC2SEL3_D4S0                 5237
#define LC2D4S                        5238
#define LC2D4S1                       5239
#define CLC2SEL3_D4S1                 5240
#define LC2D4S2                       5241
#define CLC2SEL3_D4S2                 5242
#define CLC2SEL3_D4S3                 5243
#define LC2D4S3                       5244
#define LC2D4S4                       5245
#define CLC2SEL3_D4S4                 5246
#define LC2D4S5                       5247
#define CLC2SEL3_D4S5                 5248
#define CLC2GLS0                      5249
#define LC2G1D1N                      5250
#define CLC2GLS0_D1N                  5251
#define CLC2GLS0_D1T                  5252
#define LC2G1D1T                      5253
#define LC2G1D2N                      5254
#define CLC2GLS0_D2N                  5255
#define CLC2GLS0_D2T                  5256
#define LC2G1D2T                      5257
#define LC2G1D3N                      5258
#define CLC2GLS0_D3N                  5259
#define CLC2GLS0_D3T                  5260
#define LC2G1D3T                      5261
#define LC2G1D4N                      5262
#define CLC2GLS0_D4N                  5263
#define CLC2GLS0_D4T                  5264
#define LC2G1D4T                      5265
#define CLC2GLS1                      5266
#define CLC2GLS1_D1N                  5267
#define LC2G2D1N                      5268
#define CLC2GLS1_D1T                  5269
#define LC2G2D1T                      5270
#define CLC2GLS1_D2N                  5271
#define LC2G2D2N                      5272
#define CLC2GLS1_D2T                  5273
#define LC2G2D2T                      5274
#define LC2G2D3N                      5275
#define CLC2GLS1_D3N                  5276
#define LC2G2D3T                      5277
#define CLC2GLS1_D3T                  5278
#define LC2G2D4N                      5279
#define CLC2GLS1_D4N                  5280
#define LC2G2D4T                      5281
#define CLC2GLS1_D4T                  5282
#define CLC2GLS2                      5283
#define LC2G3D1N                      5284
#define CLC2GLS2_D1N                  5285
#define CLC2GLS2_D1T                  5286
#define LC2G3D1T                      5287
#define CLC2GLS2_D2N                  5288
#define LC2G3D2N                      5289
#define LC2G3D2T                      5290
#define CLC2GLS2_D2T                  5291
#define CLC2GLS2_D3N                  5292
#define LC2G3D3N                      5293
#define CLC2GLS2_D3T                  5294
#define LC2G3D3T                      5295
#define CLC2GLS2_D4N                  5296
#define LC2G3D4N                      5297
#define LC2G3D4T                      5298
#define CLC2GLS2_D4T                  5299
#define CLC2GLS3                      5300
#define LC2G4D1N                      5301
#define CLC2GLS3_G4D1N                5302
#define CLC2GLS3_G4D1T                5303
#define LC2G4D1T                      5304
#define CLC2GLS3_G4D2N                5305
#define LC2G4D2N                      5306
#define LC2G4D2T                      5307
#define CLC2GLS3_G4D2T                5308
#define CLC2GLS3_G4D3N                5309
#define LC2G4D3N                      5310
#define CLC2GLS3_G4D3T                5311
#define LC2G4D3T                      5312
#define LC2G4D4N                      5313
#define CLC2GLS3_G4D4N                5314
#define CLC2GLS3_G4D4T                5315
#define LC2G4D4T                      5316
#define CLC3CON                       5317
#define LC3MODE0                      5318
#define CLC3CON_MODE0                 5319
#define CLC3CON_MODE                  5320
#define LC3MODE                       5321
#define LC3MODE1                      5322
#define CLC3CON_MODE1                 5323
#define LC3MODE2                      5324
#define CLC3CON_MODE2                 5325
#define LC3INTN                       5326
#define CLC3CON_INTN                  5327
#define CLC3CON_INTP                  5328
#define LC3INTP                       5329
#define CLC3CON_OUT                   5330
#define LC3OUT                        5331
#define LC3EN                         5332
#define CLC3CON_EN                    5333
#define CLC3POL                       5334
#define LC3G1POL                      5335
#define CLC3POL_G1POL                 5336
#define LC3G2POL                      5337
#define CLC3POL_G2POL                 5338
#define CLC3POL_G3POL                 5339
#define LC3G3POL                      5340
#define LC3G4POL                      5341
#define CLC3POL_G4POL                 5342
#define LC3POL                        5343
#define CLC3POL_POL                   5344
#define CLC3SEL0                      5345
#define CLC3SEL0_D1S0                 5346
#define LC3D1S0                       5347
#define CLC3SEL0_D1S                  5348
#define LC3D1S                        5349
#define LC3D1S1                       5350
#define CLC3SEL0_D1S1                 5351
#define LC3D1S2                       5352
#define CLC3SEL0_D1S2                 5353
#define LC3D1S3                       5354
#define CLC3SEL0_D1S3                 5355
#define LC3D1S4                       5356
#define CLC3SEL0_D1S4                 5357
#define LC3D1S5                       5358
#define CLC3SEL0_D1S5                 5359
#define CLC3SEL1                      5360
#define CLC3SEL1_D2S                  5361
#define CLC3SEL1_D2S0                 5362
#define LC3D2S                        5363
#define LC3D2S0                       5364
#define CLC3SEL1_D2S1                 5365
#define LC3D2S1                       5366
#define CLC3SEL1_D2S2                 5367
#define LC3D2S2                       5368
#define CLC3SEL1_D2S3                 5369
#define LC3D2S3                       5370
#define CLC3SEL1_D2S4                 5371
#define LC3D2S4                       5372
#define CLC3SEL1_D2S5                 5373
#define LC3D2S5                       5374
#define CLC3SEL2                      5375
#define LC3D3S                        5376
#define CLC3SEL2_D3S                  5377
#define LC3D3S0                       5378
#define CLC3SEL2_D3S0                 5379
#define LC3D3S1                       5380
#define CLC3SEL2_D3S1                 5381
#define LC3D3S2                       5382
#define CLC3SEL2_D3S2                 5383
#define LC3D3S3                       5384
#define CLC3SEL2_D3S3                 5385
#define CLC3SEL2_D3S4                 5386
#define LC3D3S4                       5387
#define CLC3SEL2_D3S5                 5388
#define LC3D3S5                       5389
#define CLC3SEL3                      5390
#define CLC3SEL3_D4S0                 5391
#define LC3D4S0                       5392
#define CLC3SEL3_D4S                  5393
#define LC3D4S                        5394
#define LC3D4S1                       5395
#define CLC3SEL3_D4S1                 5396
#define LC3D4S2                       5397
#define CLC3SEL3_D4S2                 5398
#define LC3D4S3                       5399
#define CLC3SEL3_D4S3                 5400
#define LC3D4S4                       5401
#define CLC3SEL3_D4S4                 5402
#define LC3D4S5                       5403
#define CLC3SEL3_D4S5                 5404
#define CLC3GLS0                      5405
#define CLC3GLS0_D1N                  5406
#define LC3G1D1N                      5407
#define LC3G1D1T                      5408
#define CLC3GLS0_D1T                  5409
#define LC3G1D2N                      5410
#define CLC3GLS0_D2N                  5411
#define CLC3GLS0_D2T                  5412
#define LC3G1D2T                      5413
#define CLC3GLS0_D3N                  5414
#define LC3G1D3N                      5415
#define LC3G1D3T                      5416
#define CLC3GLS0_D3T                  5417
#define CLC3GLS0_D4N                  5418
#define LC3G1D4N                      5419
#define CLC3GLS0_D4T                  5420
#define LC3G1D4T                      5421
#define CLC3GLS1                      5422
#define LC3G2D1N                      5423
#define CLC3GLS1_D1N                  5424
#define CLC3GLS1_D1T                  5425
#define LC3G2D1T                      5426
#define LC3G2D2N                      5427
#define CLC3GLS1_D2N                  5428
#define LC3G2D2T                      5429
#define CLC3GLS1_D2T                  5430
#define LC3G2D3N                      5431
#define CLC3GLS1_D3N                  5432
#define CLC3GLS1_D3T                  5433
#define LC3G2D3T                      5434
#define LC3G2D4N                      5435
#define CLC3GLS1_D4N                  5436
#define LC3G2D4T                      5437
#define CLC3GLS1_D4T                  5438
#define CLC3GLS2                      5439
#define LC3G3D1N                      5440
#define CLC3GLS2_D1N                  5441
#define LC3G3D1T                      5442
#define CLC3GLS2_D1T                  5443
#define CLC3GLS2_D2N                  5444
#define LC3G3D2N                      5445
#define CLC3GLS2_D2T                  5446
#define LC3G3D2T                      5447
#define CLC3GLS2_D3N                  5448
#define LC3G3D3N                      5449
#define LC3G3D3T                      5450
#define CLC3GLS2_D3T                  5451
#define CLC3GLS2_D4N                  5452
#define LC3G3D4N                      5453
#define CLC3GLS2_D4T                  5454
#define LC3G3D4T                      5455
#define CLC3GLS3                      5456
#define LC3G4D1N                      5457
#define CLC3GLS3_G4D1N                5458
#define LC3G4D1T                      5459
#define CLC3GLS3_G4D1T                5460
#define LC3G4D2N                      5461
#define CLC3GLS3_G4D2N                5462
#define CLC3GLS3_G4D2T                5463
#define LC3G4D2T                      5464
#define LC3G4D3N                      5465
#define CLC3GLS3_G4D3N                5466
#define CLC3GLS3_G4D3T                5467
#define LC3G4D3T                      5468
#define LC3G4D4N                      5469
#define CLC3GLS3_G4D4N                5470
#define LC3G4D4T                      5471
#define CLC3GLS3_G4D4T                5472
#define CLC4CON                       5473
#define LC4MODE                       5474
#define CLC4CON_MODE                  5475
#define LC4MODE0                      5476
#define CLC4CON_MODE0                 5477
#define LC4MODE1                      5478
#define CLC4CON_MODE1                 5479
#define LC4MODE2                      5480
#define CLC4CON_MODE2                 5481
#define LC4INTN                       5482
#define CLC4CON_INTN                  5483
#define CLC4CON_INTP                  5484
#define LC4INTP                       5485
#define CLC4CON_OUT                   5486
#define LC4OUT                        5487
#define CLC4CON_EN                    5488
#define LC4EN                         5489
#define CLC4POL                       5490
#define CLC4POL_G1POL                 5491
#define LC4G1POL                      5492
#define CLC4POL_G2POL                 5493
#define LC4G2POL                      5494
#define CLC4POL_G3POL                 5495
#define LC4G3POL                      5496
#define LC4G4POL                      5497
#define CLC4POL_G4POL                 5498
#define LC4POL                        5499
#define CLC4POL_POL                   5500
#define CLC4SEL0                      5501
#define CLC4SEL0_D1S0                 5502
#define LC4D1S0                       5503
#define CLC4SEL0_D1S                  5504
#define LC4D1S                        5505
#define CLC4SEL0_D1S1                 5506
#define LC4D1S1                       5507
#define CLC4SEL0_D1S2                 5508
#define LC4D1S2                       5509
#define CLC4SEL0_D1S3                 5510
#define LC4D1S3                       5511
#define CLC4SEL0_D1S4                 5512
#define LC4D1S4                       5513
#define CLC4SEL0_D1S5                 5514
#define LC4D1S5                       5515
#define CLC4SEL1                      5516
#define LC4D2S0                       5517
#define CLC4SEL1_D2S                  5518
#define CLC4SEL1_D2S0                 5519
#define LC4D2S                        5520
#define CLC4SEL1_D2S1                 5521
#define LC4D2S1                       5522
#define LC4D2S2                       5523
#define CLC4SEL1_D2S2                 5524
#define LC4D2S3                       5525
#define CLC4SEL1_D2S3                 5526
#define LC4D2S4                       5527
#define CLC4SEL1_D2S4                 5528
#define LC4D2S5                       5529
#define CLC4SEL1_D2S5                 5530
#define CLC4SEL2                      5531
#define LC4D3S                        5532
#define CLC4SEL2_D3S                  5533
#define CLC4SEL2_D3S0                 5534
#define LC4D3S0                       5535
#define LC4D3S1                       5536
#define CLC4SEL2_D3S1                 5537
#define CLC4SEL2_D3S2                 5538
#define LC4D3S2                       5539
#define CLC4SEL2_D3S3                 5540
#define LC4D3S3                       5541
#define CLC4SEL2_D3S4                 5542
#define LC4D3S4                       5543
#define CLC4SEL2_D3S5                 5544
#define LC4D3S5                       5545
#define CLC4SEL3                      5546
#define LC4D4S0                       5547
#define LC4D4S                        5548
#define CLC4SEL3_D4S0                 5549
#define CLC4SEL3_D4S                  5550
#define LC4D4S1                       5551
#define CLC4SEL3_D4S1                 5552
#define LC4D4S2                       5553
#define CLC4SEL3_D4S2                 5554
